Repository: Rizz404/sigma_track
Catalog: lib/feature/home/l10n/home_*.arb
Languages: id, ja

# homeScreen
source: Home
id: Beranda
ja: ホーム

# homeFailedToLoadData
source: Failed to Load User Statistics
id: Gagal meload statistik pengguna
ja: データの読み込みに失敗しました

# homeTryAgain
source: Try Again
id: Coba Lagi
ja: 再試行

# homeMyTotalAssets
source: My Total Assets
id: Total Aset Saya
ja: 私の総資産

# homeTotalAssetValue
source: Total Asset Value
id: Total Nilai Aset
ja: 総資産価値

# homeMyAssetCondition
source: My Asset Condition
id: Kondisi Aset Saya
ja: 私の資産状態

# homeAssetConditionDetail
source: Asset Condition Detail
id: Detail Kondisi Aset
ja: 資産状態の詳細

# homeMyIssueReportStatus
source: My Issue Report Status
id: Status Laporan Masalah Saya
ja: 私の問題報告ステータス

# homeIssueReportPriority
source: Issue Report Priority
id: Prioritas Laporan Masalah
ja: 問題報告の優先度

# homeHealthScore
source: Health Score
id: Skor Kesehatan
ja: ヘルススコア

# homeActiveReports
source: Active Reports
id: Laporan Aktif
ja: アクティブな報告

# homeAccountAge
source: Account Age
id: Usia Akun
ja: アカウント年齢

# homeTotalReports
source: Total Reports
id: Total Laporan
ja: 総報告数

# homeYes
source: Yes
id: Ya
ja: はい

# homeNo
source: No
id: Tidak
ja: いいえ
