Repository: Rizz404/sigma_track
Catalog: lib/l10n/app_*.arb
Languages: id, ja

# assetMovementMovementDate
source: Movement Date
id: Tanggal Perpindahan
ja: 移動日

# assetMovementNotes
source: Notes
id: Catatan
ja: メモ

# assetMovementStatus
source: Status
ja: ステータス

# assetMovementMetadata
source: Metadata
ja: メタデータ

# assetMovementCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# assetMovementUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# assetMovementOnlyAdminCanEdit
source: Only admin can edit asset movements
id: Hanya admin yang dapat mengedit perpindahan aset
ja: 資産移動を編集できるのは管理者のみです

# assetMovementOnlyAdminCanDelete
source: Only admin can delete asset movements
id: Hanya admin yang dapat menghapus perpindahan aset
ja: 資産移動を削除できるのは管理者のみです

# assetMovementFailedToLoad
source: Failed to load asset movement
id: Gagal memuat perpindahan aset
ja: 資産移動の読み込みに失敗しました

# assetMovementEditAssetMovement
source: Edit Asset Movement
id: Edit Perpindahan Aset
ja: 資産移動を編集

# assetMovementCreateAssetMovement
source: Create Asset Movement
id: Buat Perpindahan Aset
ja: 資産移動を作成

# assetMovementFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須フィールドをすべて入力してください

# assetMovementSelectAsset
source: Please select an asset
id: Harap pilih aset
ja: 資産を選択してください

source: Asset movement saved successfully
id: Perpindahan aset berhasil disimpan
ja: 資産移動が正常に保存されました

# assetMovementOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# assetMovementBasicInformation
source: Basic Information
id: Informasi Dasar
ja: 基本情報

# assetMovementSelectAssetPlaceholder
source: Select asset
id: Pilih aset
ja: 資産を選択

# assetMovementSearchAsset
source: Search asset...
id: Cari aset...
ja: 資産を検索...

# assetMovementSelectMovementType
source: Select movement type
id: Pilih jenis perpindahan
ja: 移動タイプを選択

# assetMovementLocationDetails
source: Location Details
id: Detail Lokasi
ja: 場所の詳細

# assetMovementFromLocationLabel
source: From Location
id: Dari Lokasi
ja: 移動元の場所

# assetMovementSearchFromLocation
source: Search from location...
id: Cari dari lokasi...
ja: 移動元の場所を検索...

# assetMovementToLocationLabel
source: To Location
id: Ke Lokasi
ja: 移動先の場所

# assetMovementSearchToLocation
source: Search to location...
id: Cari ke lokasi...
ja: 移動先の場所を検索...

# assetMovementUserDetails
source: User Details
id: Detail Pengguna
ja: ユーザーの詳細

# assetMovementFromUserLabel
source: From User
id: Dari Pengguna
ja: 移動元のユーザー

# assetMovementSearchFromUser
source: Search from user...
id: Cari dari pengguna...
ja: 移動元のユーザーを検索...

# assetMovementToUserLabel
source: To User
id: Ke Pengguna
ja: 移動先のユーザー

# assetMovementSearchToUser
source: Search to user...
id: Cari ke pengguna...
ja: 移動先のユーザーを検索...

# assetMovementMovementDateLabel
source: Movement Date
id: Tanggal Perpindahan
ja: 移動日

# assetMovementNotesLabel
source: Notes (Optional)
id: Catatan (Opsional)
ja: メモ (オプション)

# assetMovementEnterNotes
source: Enter notes...
id: Masukkan catatan...
ja: メモを入力...

# assetMovementUpdate
source: Update
id: Perbarui
ja: 更新

# assetMovementCreate
source: Create
id: Buat
ja: 作成

source: Asset Movement Management
id: Manajemen Perpindahan Aset
ja: 資産移動管理

# assetMovementSearchAssetMovements
source: Search asset movements...
id: Cari perpindahan aset...
ja: 資産移動を検索...

# assetMovementNoMovementsFound
source: No asset movements found
id: Tidak ada perpindahan aset ditemukan
ja: 資産移動が見つかりません

# assetMovementCreateFirstMovement
source: Create your first asset movement to get started
id: Buat perpindahan aset pertama Anda untuk memulai
ja: 最初の資産移動を作成して開始しましょう

# assetMovementFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# assetMovementFilterAndSortSubtitle
source: Customize asset movement display
id: Sesuaikan tampilan perpindahan aset
ja: 資産移動表示をカスタマイズ

# assetMovementFilterByAsset
source: Filter by Asset
id: Filter berdasarkan Aset
ja: 資産でフィルター

# assetMovementFilterByMovementType
source: Filter by Movement Type
id: Filter berdasarkan Jenis Perpindahan
ja: 移動タイプでフィルター

# assetMovementFilterByLocation
source: Filter by Location
id: Filter berdasarkan Lokasi
ja: 場所でフィルター

# assetMovementFilterByUser
source: Filter by User
id: Filter berdasarkan Pengguna
ja: ユーザーでフィルター

# assetMovementSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# assetMovementSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# assetMovementReset
source: Reset
ja: リセット

# assetMovementApply
source: Apply
id: Terapkan
ja: 適用

# assetMovementFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# assetMovementFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# assetMovementStatistics
source: Movement Statistics
id: Statistik Perpindahan
ja: 移動統計

# assetMovementTotalMovements
source: Total Movements
id: Total Perpindahan
ja: 総移動数

# assetMovementByType
source: Movements by Type
id: Perpindahan berdasarkan Jenis
ja: タイプ別移動

# assetMovementByStatus
source: Movements by Status
id: Perpindahan berdasarkan Status
ja: ステータス別移動

# assetMovementRecentActivity
source: Recent Activity
id: Aktivitas Terbaru
ja: 最近のアクティビティ

# assetMovementValidationAssetRequired
source: Asset is required
id: Aset wajib diisi
ja: 資産は必須です

# assetMovementValidationMovementTypeRequired
source: Movement type is required
id: Jenis perpindahan wajib diisi
ja: 移動タイプは必須です

# assetMovementValidationLocationRequired
source: Location is required for this movement type
id: Lokasi wajib diisi untuk jenis perpindahan ini
ja: この移動タイプには場所が必要です

# assetMovementValidationUserRequired
source: User is required for this movement type
id: Pengguna wajib diisi untuk jenis perpindahan ini
ja: この移動タイプにはユーザーが必要です

# assetMovementValidationMovementDateRequired
source: Movement date is required
id: Tanggal perpindahan wajib diisi
ja: 移動日は必須です

# assetMovementValidationNotesMaxLength
source: Notes must not exceed 500 characters
id: Catatan maksimal 500 karakter
ja: メモは500文字を超えることはできません

# assetMovementValidationToLocationRequired
source: To location is required
id: Lokasi tujuan wajib diisi
ja: 移動先の場所は必須です

# assetMovementValidationToUserRequired
source: To user is required
id: Pengguna tujuan wajib diisi
ja: 移動先のユーザーは必須です

# assetMovementValidationMovedByRequired
source: Moved by is required
id: Dipindahkan oleh wajib diisi
ja: 移動者は必須です

# assetMovementValidationMovementDateFuture
source: Movement date cannot be in the future
id: Tanggal perpindahan tidak boleh di masa depan
ja: 移動日は未来の日付にすることはできません

# assetMovementTranslations
source: Translations
id: Terjemahan
ja: 翻訳

# assetMovementUnknownAsset
source: Unknown Asset
id: Aset Tidak Diketahui
ja: 不明な資産

# assetMovementUnknownTag
source: Unknown Tag
id: Tag Tidak Diketahui
ja: 不明なタグ

# assetMovementUnknown
source: Unknown
id: Tidak Diketahui
ja: 不明

# assetMovementUnassigned
source: Unassigned
id: Tidak Ditugaskan
ja: 未割り当て

# assetMovementNotSet
source: Not set
id: Tidak diatur
ja: 未設定

# assetMovementLocationMovement
source: Location Movement
id: Perpindahan Lokasi
ja: 場所移動

# assetMovementUserMovement
source: User Movement
id: Perpindahan Pengguna
ja: ユーザー移動

# assetMovementCreateAssetMovementTitle
source: Create Asset Movement
id: Buat Perpindahan Aset
ja: 資産移動を作成

# assetMovementCreateAssetMovementSubtitle
source: Record a new asset movement
id: Catat perpindahan aset baru
ja: 新しい資産移動を記録

source: Asset Movement for Location
id: Perpindahan Aset untuk Lokasi
ja: 場所の資産移動

source: Asset Movement for User
id: Perpindahan Aset untuk Pengguna
ja: ユーザーの資産移動

# assetMovementCurrentLocation
source: Current Location
id: Lokasi Saat Ini
ja: 現在の場所

# assetMovementNewLocation
source: New Location
id: Lokasi Baru
ja: 新しい場所

# assetMovementCurrentUser
source: Current User
id: Pengguna Saat Ini
ja: 現在のユーザー

# assetMovementNewUser
source: New User
id: Pengguna Baru
ja: 新しいユーザー

# assetMovementMovementHistory
source: Movement History
id: Riwayat Perpindahan
ja: 移動履歴

# assetMovementNoHistory
source: No movement history available
id: Tidak ada riwayat perpindahan tersedia
ja: 移動履歴がありません

# assetMovementViewAll
source: View All
id: Lihat Semua
ja: すべて表示

# assetMovementMovedTo
source: Moved to
id: Dipindahkan ke
ja: に移動

# assetMovementAssignedTo
source: Assigned to
id: Ditugaskan ke
ja: に割り当て

# assetMovementSelectMany
source: Select Many
id: Pilih Banyak
ja: 複数選択

# assetMovementSelectManySubtitle
source: Select multiple asset movements to delete
id: Pilih beberapa perpindahan aset untuk dihapus
ja: 複数の資産移動を削除するために選択

# assetMovementSelectAssetMovementsToDelete
source: Select asset movements to delete
id: Pilih perpindahan aset untuk dihapus
ja: 削除する資産移動を選択してください

# assetMovementChooseMovementType
source: Choose movement type:
id: Pilih jenis perpindahan:
ja: 移動タイプを選択：

# assetMovementFilterByFromLocation
source: Filter by From Location
id: Filter berdasarkan Dari Lokasi
ja: 移動元の場所でフィルター

# assetMovementFilterByToLocation
source: Filter by To Location
id: Filter berdasarkan Ke Lokasi
ja: 移動先の場所でフィルター

# assetMovementFilterByFromUser
source: Filter by From User
id: Filter berdasarkan Dari Pengguna
ja: 移動元のユーザーでフィルター

# assetMovementFilterByToUser
source: Filter by To User
id: Filter berdasarkan Ke Pengguna
ja: 移動先のユーザーでフィルター

# assetMovementFilterByMovedBy
source: Filter by Moved By
id: Filter berdasarkan Dipindahkan Oleh
ja: 移動者でフィルター

# assetMovementDateFrom
source: Date From
id: Tanggal Dari
ja: 開始日

# assetMovementDateTo
source: Date To
id: Tanggal Sampai
ja: 終了日

# assetMovementSearchAssetPlaceholder
source: Search asset...
id: Cari aset...
ja: 資産を検索...

# assetMovementSearchFromLocationPlaceholder
source: Search from location...
id: Cari dari lokasi...
ja: 移動元の場所を検索...

# assetMovementSearchToLocationPlaceholder
source: Search to location...
id: Cari ke lokasi...
ja: 移動先の場所を検索...

# assetMovementSearchFromUserPlaceholder
source: Search from user...
id: Cari dari pengguna...
ja: 移動元のユーザーを検索...

# assetMovementSearchToUserPlaceholder
source: Search to user...
id: Cari ke pengguna...
ja: 移動先のユーザーを検索...

# assetMovementSearchMovedByPlaceholder
source: Search moved by user...
id: Cari pengguna yang memindahkan...
ja: 移動者のユーザーを検索...

# assetMovementDeleteAssetMovements
source: Delete Asset Movements
id: Hapus Perpindahan Aset
ja: 資産移動を削除

# assetMovementDeleteManyConfirmation
source: Are you sure you want to delete {count} asset movements?
id: Apakah Anda yakin ingin menghapus {count} perpindahan aset?
ja: {count}件の資産移動を削除してもよろしいですか？

# assetMovementNoAssetMovementsSelected
source: No asset movements selected
id: Tidak ada perpindahan aset yang dipilih
ja: 資産移動が選択されていません

# assetMovementNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# assetMovementSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}件選択中

# assetMovementLongPressToSelectMore
source: Long press to select more asset movements
id: Tekan lama untuk memilih lebih banyak perpindahan aset
ja: 長押しでさらに資産移動を選択

# assetMovementForLocationShort
source: For Location
id: Untuk Lokasi
ja: 場所へ

# assetMovementForUserShort
source: For User
id: Untuk Pengguna
ja: ユーザーへ

# authWelcomeBack
source: Welcome Back
id: Selamat Datang Kembali
ja: おかえりなさい

# authSignInToContinue
source: Sign in to continue
id: Masuk untuk melanjutkan
ja: 続けるにはログインしてください

# authEmail
source: Email
ja: メール

# authEnterYourEmail
source: Enter your email
id: Masukkan email Anda
ja: メールアドレスを入力

# authPassword
source: Password
id: Kata Sandi
ja: パスワード

# authEnterYourPassword
source: Enter your password
id: Masukkan kata sandi Anda
ja: パスワードを入力

# authForgotPassword
source: Forgot Password?
id: Lupa Kata Sandi?
ja: パスワードをお忘れですか？

# authLogin
source: Login
id: Masuk
ja: ログイン

# authDontHaveAccount
source: Don't have an account?
id: Belum punya akun?
ja: アカウントをお持ちでないですか？

# authRegister
source: Register
id: Daftar
ja: 登録

# authLoginSuccessful
source: Login successful
id: Login berhasil
ja: ログイン成功

# authCreateAccount
source: Create Account
id: Buat Akun
ja: アカウント作成

# authSignUpToGetStarted
source: Sign up to get started
id: Daftar untuk memulai
ja: 登録して始めましょう

# authName
source: Name
id: Nama
ja: 名前

# authEnterYourName
source: Enter your name
id: Masukkan nama Anda
ja: 名前を入力

# authConfirmPassword
source: Confirm Password
id: Konfirmasi Kata Sandi
ja: パスワード確認

# authReEnterYourPassword
source: Re-enter your password
id: Masukkan ulang kata sandi Anda
ja: パスワードを再入力

# authPasswordMustContain
source: Password must contain:
id: Kata sandi harus berisi:
ja: パスワードには以下が必要です：

# authPasswordRequirementPlaceholder
source: Just make the password man!
id: Buat kata sandi saja bro!
ja: とにかくパスワードを入力してください！

# authRegistrationSuccessful
source: Registration successful
id: Pendaftaran berhasil
ja: 登録成功

# authAlreadyHaveAccount
source: Already have an account?
id: Sudah punya akun?
ja: 既にアカウントをお持ちですか？

# authForgotPasswordTitle
source: Forgot Password
id: Lupa Kata Sandi
ja: パスワードを忘れた

# authEnterEmailToResetPassword
source: Enter your email to reset your password
id: Masukkan email Anda untuk mereset kata sandi
ja: パスワードをリセットするにはメールアドレスを入力してください

# authSendResetLink
source: Send Reset Link
id: Kirim Tautan Reset
ja: リセットリンクを送信

# authEmailSentSuccessfully
source: Email sent successfully
id: Email berhasil dikirim
ja: メール送信成功

# authRememberPassword
source: Remember your password?
id: Ingat kata sandi Anda?
ja: パスワードを思い出しましたか？

# authValidationEmailRequired
source: Email is required
id: Email wajib diisi
ja: メールは必須です

# authValidationEmailInvalid
source: Please enter a valid email address
id: Silakan masukkan alamat email yang valid
ja: 有効なメールアドレスを入力してください

# authValidationPasswordRequired
source: Password is required
id: Kata sandi wajib diisi
ja: パスワードは必須です

# authValidationNameRequired
source: Name is required
id: Nama wajib diisi
ja: 名前は必須です

# authValidationNameMinLength
source: Name must be at least 3 characters
id: Nama minimal 3 karakter
ja: 名前は3文字以上である必要があります

# authValidationNameMaxLength
source: Name must not exceed 20 characters
id: Nama maksimal 20 karakter
ja: 名前は20文字を超えることはできません

# authValidationNameAlphanumeric
source: Name can only contain letters, numbers, and underscores
id: Nama hanya boleh berisi huruf, angka, dan garis bawah
ja: 名前には英数字とアンダースコアのみ使用できます

# authValidationConfirmPasswordRequired
source: Please confirm your password
id: Silakan konfirmasi kata sandi Anda
ja: パスワードを確認してください

# authValidationPasswordsDoNotMatch
source: Passwords do not match
id: Kata sandi tidak cocok
ja: パスワードが一致しません

# authVerifyResetCode
source: Verify Reset Code
id: Verifikasi Kode Reset
ja: リセットコードの確認

# authEnterResetCode
source: Enter the reset code sent to your email
id: Masukkan kode reset yang dikirim ke email Anda
ja: メールに送信されたリセットコードを入力してください

# authResetCode
source: Reset Code
id: Kode Reset
ja: リセットコード

# authEnterResetCodePlaceholder
source: Enter reset code
id: Masukkan kode reset
ja: リセットコードを入力

# authVerifyCode
source: Verify Code
id: Verifikasi Kode
ja: コードを確認

# authResetPasswordTitle
source: Reset Password
id: Reset Kata Sandi
ja: パスワードリセット

# authEnterNewPassword
source: Enter your new password
id: Masukkan kata sandi baru Anda
ja: 新しいパスワードを入力してください

# authNewPassword
source: New Password
id: Kata Sandi Baru
ja: 新しいパスワード

# authEnterNewPasswordPlaceholder
source: Enter new password
id: Masukkan kata sandi baru
ja: 新しいパスワードを入力

# authConfirmNewPassword
source: Confirm New Password
id: Konfirmasi Kata Sandi Baru
ja: 新しいパスワードの確認

# authReEnterNewPassword
source: Re-enter new password
id: Masukkan ulang kata sandi baru
ja: 新しいパスワードを再入力

# authResetPasswordButton
source: Reset Password
id: Reset Kata Sandi
ja: パスワードリセット

# authCodeVerifiedSuccessfully
source: Code verified successfully
id: Kode berhasil diverifikasi
ja: コードが正常に確認されました

# authPasswordResetSuccessfully
source: Password reset successfully
id: Kata sandi berhasil direset
ja: パスワードが正常にリセットされました

# authValidationResetCodeRequired
source: Reset code is required
id: Kode reset wajib diisi
ja: リセットコードは必須です

# authValidationResetCodeLength
source: Reset code must be 6 characters
id: Kode reset harus 6 karakter
ja: リセットコードは6文字である必要があります

# authValidationNewPasswordRequired
source: New password is required
id: Kata sandi baru wajib diisi
ja: 新しいパスワードは必須です

source: Category Detail
id: Detail Kategori
ja: カテゴリ詳細

source: Category Information
id: Informasi Kategori
ja: カテゴリ情報

# categoryCategoryCode
source: Category Code
id: Kode Kategori
ja: カテゴリコード

# categoryCategoryName
source: Category Name
id: Nama Kategori
ja: カテゴリ名

# categoryDescription
source: Description
id: Deskripsi
ja: 説明

# categoryParentCategory
source: Parent Category
id: Kategori Induk
ja: 親カテゴリ

# categoryMetadata
source: Metadata
ja: メタデータ

# categoryCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# categoryUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# categoryOnlyAdminCanEdit
source: Only admin can edit categories
id: Hanya admin yang dapat mengedit kategori
ja: カテゴリを編集できるのは管理者のみです

# categoryOnlyAdminCanDelete
source: Only admin can delete categories
id: Hanya admin yang dapat menghapus kategori
ja: カテゴリを削除できるのは管理者のみです

# categoryDeleteCategory
source: Delete Category
id: Hapus Kategori
ja: カテゴリを削除

# categoryDeleteConfirmation
source: Are you sure you want to delete "{categoryName}"?
id: Apakah Anda yakin ingin menghapus "{categoryName}"?
ja: "{categoryName}"を削除してもよろしいですか？

# categoryCancel
source: Cancel
id: Batal
ja: キャンセル

# categoryDelete
source: Delete
id: Hapus
ja: 削除

# categoryCategoryDeleted
source: Category deleted
id: Kategori dihapus
ja: カテゴリが削除されました

# categoryDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# categoryEditCategory
source: Edit Category
id: Edit Kategori
ja: カテゴリを編集

# categoryCreateCategory
source: Create Category
id: Buat Kategori
ja: カテゴリを作成

# categorySearchCategory
source: Search category...
id: Cari kategori...
ja: カテゴリを検索...

# categoryEnterCategoryCode
source: Enter category code (e.g., CAT-001)
id: Masukkan kode kategori (contoh: CAT-001)
ja: カテゴリコードを入力 (例: CAT-001)

# categoryTranslations
source: Translations
id: Terjemahan
ja: 翻訳

# categoryAddTranslations
source: Add translations for different languages
id: Tambahkan terjemahan untuk bahasa yang berbeda
ja: さまざまな言語の翻訳を追加

# categoryEnglish
source: English
id: Inggris
ja: 英語

# categoryJapanese
source: Japanese
id: Jepang
ja: 日本語

# categoryIndonesian
source: Indonesian
id: Indonesia
ja: インドネシア語

# categoryEnterCategoryName
source: Enter category name
id: Masukkan nama kategori
ja: カテゴリ名を入力

# categoryEnterDescription
source: Enter description
id: Masukkan deskripsi
ja: 説明を入力

# categoryUpdate
source: Update
id: Perbarui
ja: 更新

# categoryCreate
source: Create
id: Buat
ja: 作成

# categoryFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須フィールドをすべて入力してください

source: Category saved successfully
id: Kategori berhasil disimpan
ja: カテゴリが正常に保存されました

# categoryOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# categoryFailedToLoadTranslations
source: Failed to load translations
id: Gagal memuat terjemahan
ja: 翻訳の読み込みに失敗しました

source: Category Management
id: Manajemen Kategori
ja: カテゴリ管理

# categorySearchCategories
source: Search categories...
id: Cari kategori...
ja: カテゴリを検索...

# categoryCreateCategoryTitle
source: Create Category
id: Buat Kategori
ja: カテゴリを作成

# categoryCreateCategorySubtitle
source: Add a new category
id: Tambah kategori baru
ja: 新しいカテゴリを追加

# categorySelectManyTitle
source: Select Many
id: Pilih Banyak
ja: 複数選択

# categorySelectManySubtitle
source: Select multiple categories to delete
id: Pilih beberapa kategori untuk dihapus
ja: 削除する複数のカテゴリを選択

# categoryFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# categoryFilterAndSortSubtitle
source: Customize category display
id: Sesuaikan tampilan kategori
ja: カテゴリ表示をカスタマイズ

# categorySelectCategoriesToDelete
source: Select categories to delete
id: Pilih kategori untuk dihapus
ja: 削除するカテゴリを選択

# categorySortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# categorySortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# categoryHasParent
source: Has Parent
id: Memiliki Induk
ja: 親カテゴリあり

# categoryFilterByParent
source: Filter by Parent Category
id: Filter berdasarkan Kategori Induk
ja: 親カテゴリでフィルター

# categorySearchParentCategory
source: Search parent category...
id: Cari kategori induk...
ja: 親カテゴリを検索...

# categoryReset
source: Reset
ja: リセット

# categoryApply
source: Apply
id: Terapkan
ja: 適用

# categoryFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# categoryFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# categoryDeleteCategories
source: Delete Categories
id: Hapus Kategori
ja: カテゴリを削除

# categoryDeleteMultipleConfirmation
source: Are you sure you want to delete {count} categories?
id: Apakah Anda yakin ingin menghapus {count} kategori?
ja: {count}個のカテゴリを削除してもよろしいですか？

# categoryNoCategoriesSelected
source: No categories selected
id: Tidak ada kategori yang dipilih
ja: カテゴリが選択されていません

# categoryNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# categorySelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}個選択済み

# categoryNoCategoriesFound
source: No categories found
id: Tidak ada kategori ditemukan
ja: カテゴリが見つかりません

# categoryCreateFirstCategory
source: Create your first category to get started
id: Buat kategori pertama Anda untuk memulai
ja: 最初のカテゴリを作成して開始しましょう

# categoryLongPressToSelect
source: Long press to select more categories
id: Tekan lama untuk memilih lebih banyak kategori
ja: 長押ししてさらにカテゴリを選択

# categoryValidationCodeRequired
source: Category code is required
id: Kode kategori wajib diisi
ja: カテゴリコードは必須です

# categoryValidationCodeMinLength
source: Category code must be at least 2 characters
id: Kode kategori minimal 2 karakter
ja: カテゴリコードは2文字以上である必要があります

# categoryValidationCodeMaxLength
source: Category code must not exceed 20 characters
id: Kode kategori maksimal 20 karakter
ja: カテゴリコードは20文字を超えることはできません

# categoryValidationCodeAlphanumeric
source: Category code can only contain letters, numbers, and underscores
id: Kode kategori hanya boleh mengandung huruf, angka, dan garis bawah
ja: カテゴリコードには英数字とアンダースコアのみ使用できます

# categoryValidationNameRequired
source: Category name is required
id: Nama kategori wajib diisi
ja: カテゴリ名は必須です

# categoryValidationNameMinLength
source: Category name must be at least 3 characters
id: Nama kategori minimal 3 karakter
ja: カテゴリ名は3文字以上である必要があります

# categoryValidationNameMaxLength
source: Category name must not exceed 100 characters
id: Nama kategori maksimal 100 karakter
ja: カテゴリ名は100文字を超えることはできません

# categoryValidationDescriptionRequired
source: Description is required
id: Deskripsi wajib diisi
ja: 説明は必須です

# categoryValidationDescriptionMinLength
source: Description must be at least 10 characters
id: Deskripsi minimal 10 karakter
ja: 説明は10文字以上である必要があります

# categoryValidationDescriptionMaxLength
source: Description must not exceed 500 characters
id: Deskripsi maksimal 500 karakter
ja: 説明は500文字を超えることはできません

source: Category Image
id: Gambar Kategori
ja: カテゴリ画像

# categoryChooseImage
source: Choose Image
id: Pilih Gambar
ja: 画像を選択

# dashboardTotalUsers
source: Total Users
id: Total Pengguna
ja: 総ユーザー数

# dashboardTotalAssets
source: Total Assets
id: Total Aset
ja: 総資産数

# dashboardAssetStatusOverview
source: Asset Status Overview
id: Ikhtisar Status Aset
ja: 資産ステータス概要

# dashboardActive
source: Active
id: Aktif
ja: 稼働中

# dashboardMaintenance
source: Maintenance
id: Pemeliharaan
ja: メンテナンス中

# dashboardDisposed
source: Disposed
id: Dibuang
ja: 廃棄済み

# dashboardLost
source: Lost
id: Hilang
ja: 紛失

# dashboardUserRoleDistribution
source: User Role Distribution
id: Distribusi Peran Pengguna
ja: ユーザー役割分布

# dashboardAdmin
source: Admin
ja: 管理者

# dashboardStaff
source: Staff
id: Staf
ja: スタッフ
