Repository: Rizz404/sigma_track
Catalog: lib/l10n/app_*.arb
Languages: id, ja

# userSelectUsersToDelete
source: Select users to delete
id: Pilih pengguna untuk dihapus
ja: 削除するユーザーを選択

# userDeleteUsers
source: Delete Users
id: Hapus Pengguna
ja: ユーザーを削除

# userDeleteConfirmation
source: Are you sure you want to delete {count} users?
id: Apakah Anda yakin ingin menghapus {count} pengguna?
ja: {count}人のユーザーを削除してもよろしいですか？

# userCancel
source: Cancel
id: Batal
ja: キャンセル

# userDelete
source: Delete
id: Hapus
ja: 削除

# userNoUsersSelected
source: No users selected
id: Tidak ada pengguna yang dipilih
ja: ユーザーが選択されていません

# userNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# userSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}人選択済み

# userSearchUsers
source: Search users...
id: Cari pengguna...
ja: ユーザーを検索...

# userNoUsersFound
source: No users found
id: Tidak ada pengguna ditemukan
ja: ユーザーが見つかりません

# userCreateFirstUser
source: Create your first user to get started
id: Buat pengguna pertama Anda untuk memulai
ja: 最初のユーザーを作成して開始しましょう

# userLongPressToSelect
source: Long press to select more users
id: Tekan lama untuk memilih lebih banyak pengguna
ja: 長押ししてさらにユーザーを選択

# userEditUser
source: Edit User
id: Edit Pengguna
ja: ユーザーを編集

# userPleaseFixErrors
source: Please fix all errors
id: Harap perbaiki semua kesalahan
ja: すべてのエラーを修正してください

# userPleaseSelectRole
source: Please select a role
id: Harap pilih peran
ja: 役割を選択してください

# userPleaseValidateFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須フィールドをすべて入力してください

source: User saved successfully
id: Pengguna berhasil disimpan
ja: ユーザーが正常に保存されました

# userOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

source: User Information
id: Informasi Pengguna
ja: ユーザー情報

# userUsername
source: Username
id: Nama Pengguna
ja: ユーザー名

# userEnterUsername
source: Enter username
id: Masukkan nama pengguna
ja: ユーザー名を入力

# userEmail
source: Email
ja: メールアドレス

# userEnterEmail
source: Enter email
id: Masukkan email
ja: メールアドレスを入力

# userPassword
source: Password
id: Kata Sandi
ja: パスワード

# userEnterPassword
source: Enter password
id: Masukkan kata sandi
ja: パスワードを入力

# userFullName
source: Full Name
id: Nama Lengkap
ja: 氏名

# userEnterFullName
source: Enter full name
id: Masukkan nama lengkap
ja: 氏名を入力

# userSelectRole
source: Select role
id: Pilih peran
ja: 役割を選択

# userEmployeeIdOptional
source: Employee ID (Optional)
id: ID Karyawan (Opsional)
ja: 従業員ID (オプション)

# userEnterEmployeeIdOptional
source: Enter employee ID
id: Masukkan ID karyawan
ja: 従業員IDを入力

# userPreferredLanguage
source: Preferred Language (Optional)
id: Bahasa Pilihan (Opsional)
ja: 優先言語 (オプション)

# userSelectLanguage
source: Select language
id: Pilih bahasa
ja: 言語を選択

# userUpdate
source: Update
id: Perbarui
ja: 更新

# userCreate
source: Create
id: Buat
ja: 作成

source: User Detail
id: Detail Pengguna
ja: ユーザー詳細

# userOnlyAdminCanEdit
source: Only admin can edit users
id: Hanya admin yang dapat mengedit pengguna
ja: ユーザーを編集できるのは管理者のみです

# userDeleteUser
source: Delete User
id: Hapus Pengguna
ja: ユーザーを削除

# userDeleteSingleConfirmation
source: Are you sure you want to delete "{fullName}"?
id: Apakah Anda yakin ingin menghapus "{fullName}"?
ja: "{fullName}"を削除してもよろしいですか？

# userOnlyAdminCanDelete
source: Only admin can delete users
id: Hanya admin yang dapat menghapus pengguna
ja: ユーザーを削除できるのは管理者のみです

source: User deleted
id: Pengguna dihapus
ja: ユーザーが削除されました

# userDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# userName
source: Name
id: Nama
ja: 名前

# userPreferredLang
source: Preferred Language
id: Bahasa Pilihan
ja: 優先言語

# userYes
source: Yes
id: Ya
ja: はい

# userNo
source: No
id: Tidak
ja: いいえ

# userMetadata
source: Metadata
ja: メタデータ

# userCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# userUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# userFailedToLoad
source: Failed to load user
id: Gagal memuat pengguna
ja: ユーザーの読み込みに失敗しました

# userFailedToLoadProfile
source: Failed to load profile
id: Gagal memuat profil
ja: プロフィールの読み込みに失敗しました

# userPersonalInformation
source: Personal Information
id: Informasi Pribadi
ja: 個人情報

# userAccountDetails
source: Account Details
id: Detail Akun
ja: アカウント詳細

# userStatus
source: Status
ja: ステータス

# userUpdateProfile
source: Update Profile
id: Perbarui Profil
ja: プロフィールを更新

# userNoUserData
source: No user data available
id: Tidak ada data pengguna tersedia
ja: ユーザーデータがありません

# userProfileInformation
source: Profile Information
id: Informasi Profil
ja: プロフィール情報

# userProfilePicture
source: Profile Picture
id: Foto Profil
ja: プロフィール画像

# userChooseImage
source: Choose image
id: Pilih gambar
ja: 画像を選択

# userProfileUpdatedSuccessfully
source: Profile updated successfully
id: Profil berhasil diperbarui
ja: プロフィールが正常に更新されました

# userChangePassword
source: Change Password
id: Ubah Kata Sandi
ja: パスワードを変更

# userChangePasswordTitle
source: Update Your Password
id: Perbarui Kata Sandi Anda
ja: パスワードを更新

# userChangePasswordDescription
source: Enter your current password and choose a new secure password.
id: Masukkan kata sandi saat ini dan pilih kata sandi baru yang aman.
ja: 現在のパスワードを入力し、新しい安全なパスワードを設定してください。

# userCurrentPassword
source: Current Password
id: Kata Sandi Saat Ini
ja: 現在のパスワード

# userEnterCurrentPassword
source: Enter current password
id: Masukkan kata sandi saat ini
ja: 現在のパスワードを入力

# userNewPassword
source: New Password
id: Kata Sandi Baru
ja: 新しいパスワード

# userEnterNewPassword
source: Enter new password
id: Masukkan kata sandi baru
ja: 新しいパスワードを入力

# userConfirmNewPassword
source: Confirm New Password
id: Konfirmasi Kata Sandi Baru
ja: 新しいパスワードを確認

# userEnterConfirmNewPassword
source: Re-enter new password
id: Masukkan ulang kata sandi baru
ja: 新しいパスワードを再入力

# userPasswordRequirements
source: Password Requirements
id: Persyaratan Kata Sandi
ja: パスワード要件

# userPasswordRequirementsList
source: At least 8 characters At least one uppercase letter At least one lowercase letter At least one number
id: Minimal 8 karakter Minimal satu huruf besar Minimal satu huruf kecil Minimal satu angka
ja: • 8文字以上 • 大文字を1つ以上 • 小文字を1つ以上 • 数字を1つ以上

# userChangePasswordButton
source: Change Password
id: Ubah Kata Sandi
ja: パスワードを変更

# userPasswordChangedSuccessfully
source: Password changed successfully
id: Kata sandi berhasil diubah
ja: パスワードが正常に変更されました

# adminShellBottomNavDashboard
source: Dashboard
id: Dasbor
ja: ダッシュボード

# adminShellBottomNavScanAsset
source: Scan Asset
id: Pindai Aset
ja: 資産をスキャン

# adminShellBottomNavProfile
source: Profile
id: Profil
ja: プロフィール

# userShellBottomNavHome
source: Home
id: Beranda
ja: ホーム

# userShellBottomNavScanAsset
source: Scan Asset
id: Pindai Aset
ja: 資産をスキャン

# userShellBottomNavProfile
source: Profile
id: Profil
ja: プロフィール

# appEndDrawerPleaseLoginFirst
source: Please login first
id: Silakan login terlebih dahulu
ja: まずログインしてください

# appEndDrawerTheme
source: Theme
id: Tema
ja: テーマ

# appEndDrawerLanguage
source: Language
id: Bahasa
ja: 言語

# appEndDrawerLogout
source: Logout
id: Keluar
ja: ログアウト

# appEndDrawerManagementSection
source: Management
id: Manajemen
ja: 管理

# appEndDrawerMaintenanceSection
source: Maintenance
id: Pemeliharaan
ja: メンテナンス

# appEndDrawerMyAssets
source: My Assets
id: Aset Saya
ja: 私の資産

# appEndDrawerNotifications
source: Notifications
id: Notifikasi
ja: 通知

# appEndDrawerMyIssueReports
source: My Issue Reports
id: Laporan Masalah Saya
ja: 私の問題報告

# appEndDrawerAssets
source: Assets
id: Aset
ja: 資産

# appEndDrawerAssetMovements
source: Asset Movements
id: Perpindahan Aset
ja: 資産移動

# appEndDrawerCategories
source: Categories
id: Kategori
ja: カテゴリ

# appEndDrawerLocations
source: Locations
id: Lokasi
ja: 場所

# appEndDrawerUsers
source: Users
id: Pengguna
ja: ユーザー

# appEndDrawerMaintenanceSchedules
source: Maintenance Schedules
id: Jadwal Pemeliharaan
ja: メンテナンススケジュール

# appEndDrawerMaintenanceRecords
source: Maintenance Records
id: Catatan Pemeliharaan
ja: メンテナンス記録

# appEndDrawerReports
source: Reports
id: Laporan
ja: レポート

# appEndDrawerIssueReports
source: Issue Reports
id: Laporan Masalah
ja: 問題報告

# appEndDrawerScanLogs
source: Scan Logs
id: Log Pemindaian
ja: スキャンログ

# appEndDrawerScanAsset
source: Scan Asset
id: Pindai Aset
ja: 資産をスキャン

# appEndDrawerDashboard
source: Dashboard
id: Dasbor
ja: ダッシュボード

# appEndDrawerHome
source: Home
id: Beranda
ja: ホーム

# appEndDrawerProfile
source: Profile
id: Profil
ja: プロフィール

# customAppBarOpenMenu
source: Open Menu
id: Buka Menu
ja: メニューを開く

# appDropdownSelectOption
source: Select option
id: Pilih opsi
ja: オプションを選択

# appSearchFieldHint
source: Search...
id: Cari...
ja: 検索...

# appSearchFieldClear
source: Clear
id: Hapus
ja: クリア

# appSearchFieldNoResultsFound
source: No results found
id: Tidak ada hasil ditemukan
ja: 結果が見つかりません

# staffShellBottomNavDashboard
source: Dashboard
id: Dasbor
ja: ダッシュボード

# staffShellBottomNavScanAsset
source: Scan Asset
id: Pindai Aset
ja: 資産をスキャン

# staffShellBottomNavProfile
source: Profile
id: Profil
ja: プロフィール

# shellDoubleBackToExitApp
source: Press back again to exit
id: Tekan kembali sekali lagi untuk keluar
ja: もう一度戻るボタンを押して終了
