Repository: Rizz404/sigma_track
Catalog: lib/l10n/app_*.arb
Languages: id, ja

# dashboardEmployee
source: Employee
id: Karyawan
ja: 従業員

# dashboardAssetStatusBreakdown
source: Asset Status Breakdown
id: Rincian Status Aset
ja: 資産ステータス内訳

# dashboardAssetConditionOverview
source: Asset Condition Overview
id: Ikhtisar Kondisi Aset
ja: 資産状態概要

# dashboardGood
source: Good
id: Baik
ja: 良好

# dashboardFair
source: Fair
id: Cukup
ja: 普通

# dashboardPoor
source: Poor
id: Buruk
ja: 不良

# dashboardDamaged
source: Damaged
id: Rusak
ja: 破損

# dashboardUserRegistrationTrends
source: User Registration Trends
id: Tren Registrasi Pengguna
ja: ユーザー登録推移

# dashboardAssetCreationTrends
source: Asset Creation Trends
id: Tren Pembuatan Aset
ja: 資産作成推移

# dashboardCategories
source: Categories
id: Kategori
ja: カテゴリ

# dashboardLocations
source: Locations
id: Lokasi
ja: 場所

# dashboardActivityOverview
source: Activity Overview
id: Ikhtisar Aktivitas
ja: 活動概要

# dashboardScanLogs
source: Scan Logs
id: Log Pemindaian
ja: スキャンログ

# dashboardNotifications
source: Notifications
id: Notifikasi
ja: 通知

# dashboardAssetMovements
source: Asset Movements
id: Perpindahan Aset
ja: 資産移動

# dashboardIssueReports
source: Issue Reports
id: Laporan Masalah
ja: 問題報告

# dashboardMaintenanceSchedules
source: Maintenance Schedules
id: Jadwal Pemeliharaan
ja: メンテナンススケジュール

# dashboardMaintenanceRecords
source: Maintenance Records
id: Catatan Pemeliharaan
ja: メンテナンス記録

# homeScreen
source: Home
id: Beranda
ja: ホーム

# issueReportDeleteIssueReport
source: Delete Issue Report
id: Hapus Laporan Masalah
ja: 問題報告を削除

# issueReportDeleteConfirmation
source: Are you sure you want to delete "{title}"?
id: Apakah Anda yakin ingin menghapus "{title}"?
ja: "{title}"を削除してもよろしいですか？

# issueReportCancel
source: Cancel
id: Batal
ja: キャンセル

# issueReportDelete
source: Delete
id: Hapus
ja: 削除

source: Issue Report Detail
id: Detail Laporan Masalah
ja: 問題報告詳細

source: Issue Report Information
id: Informasi Laporan Masalah
ja: 問題報告情報

# issueReportTitle
source: Title
id: Judul
ja: タイトル

# issueReportDescription
source: Description
id: Deskripsi
ja: 説明

# issueReportAsset
source: Asset
id: Aset
ja: 資産

# issueReportIssueType
source: Issue Type
id: Jenis Masalah
ja: 問題タイプ

# issueReportPriority
source: Priority
id: Prioritas
ja: 優先度

# issueReportStatus
source: Status
ja: ステータス

# issueReportReportedBy
source: Reported By
id: Dilaporkan Oleh
ja: 報告者

# issueReportReportedDate
source: Reported Date
id: Tanggal Dilaporkan
ja: 報告日

# issueReportResolvedDate
source: Resolved Date
id: Tanggal Diselesaikan
ja: 解決日

# issueReportResolvedBy
source: Resolved By
id: Diselesaikan Oleh
ja: 解決者

# issueReportResolutionNotes
source: Resolution Notes
id: Catatan Resolusi
ja: 解決メモ

# issueReportMetadata
source: Metadata
ja: メタデータ

# issueReportCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# issueReportUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# issueReportOnlyAdminCanEdit
source: Only admin can edit issue reports
id: Hanya admin yang dapat mengedit laporan masalah
ja: 問題報告を編集できるのは管理者のみです

# issueReportOnlyAdminCanDelete
source: Only admin can delete issue reports
id: Hanya admin yang dapat menghapus laporan masalah
ja: 問題報告を削除できるのは管理者のみです

# issueReportFailedToLoad
source: Failed to load issue report
id: Gagal memuat laporan masalah
ja: 問題報告の読み込みに失敗しました

# issueReportDeletedSuccess
source: Issue report deleted
id: Laporan masalah dihapus
ja: 問題報告が削除されました

# issueReportDeletedFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# issueReportUnknownAsset
source: Unknown Asset
id: Aset Tidak Diketahui
ja: 不明な資産

# issueReportUnknownUser
source: Unknown User
id: Pengguna Tidak Diketahui
ja: 不明なユーザー

# issueReportEditIssueReport
source: Edit Issue Report
id: Edit Laporan Masalah
ja: 問題報告を編集

# issueReportCreateIssueReport
source: Create Issue Report
id: Buat Laporan Masalah
ja: 問題報告を作成

# issueReportFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須フィールドをすべて入力してください

source: Issue report saved successfully
id: Laporan masalah berhasil disimpan
ja: 問題報告が正常に保存されました

# issueReportOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# issueReportFailedToLoadTranslations
source: Failed to load translations
id: Gagal memuat terjemahan
ja: 翻訳の読み込みに失敗しました

# issueReportSearchAsset
source: Search and select asset
id: Cari dan pilih aset
ja: 資産を検索して選択

# issueReportSearchReportedBy
source: Search and select user who reported the issue
id: Cari dan pilih pengguna yang melaporkan masalah
ja: 問題を報告したユーザーを検索して選択

# issueReportEnterIssueType
source: Enter issue type (e.g., Hardware, Software)
id: Masukkan jenis masalah (contoh: Hardware, Software)
ja: 問題タイプを入力 (例: ハードウェア、ソフトウェア)

# issueReportSelectPriority
source: Select priority
id: Pilih prioritas
ja: 優先度を選択

# issueReportSelectStatus
source: Select status
id: Pilih status
ja: ステータスを選択

# issueReportSearchResolvedBy
source: Search and select user who resolved the issue
id: Cari dan pilih pengguna yang menyelesaikan masalah
ja: 問題を解決したユーザーを検索して選択

# issueReportTranslations
source: Translations
id: Terjemahan
ja: 翻訳

# issueReportEnglish
source: English
id: Inggris
ja: 英語

# issueReportJapanese
source: Japanese
id: Jepang
ja: 日本語

# issueReportIndonesian
source: Indonesian
id: Indonesia
ja: インドネシア語

# issueReportEnterTitleIn
source: Enter title in {language}
id: Masukkan judul dalam {language}
ja: {language}でタイトルを入力

# issueReportEnterDescriptionIn
source: Enter description in {language}
id: Masukkan deskripsi dalam {language}
ja: {language}で説明を入力

# issueReportEnterResolutionNotesIn
source: Enter resolution notes in {language}
id: Masukkan catatan resolusi dalam {language}
ja: {language}で解決メモを入力

# issueReportUpdate
source: Update
id: Perbarui
ja: 更新

# issueReportCreate
source: Create
id: Buat
ja: 作成

source: IssueReport Management
id: Manajemen Laporan Masalah
ja: 問題報告管理

# issueReportCreateIssueReportTitle
source: Create IssueReport
id: Buat Laporan Masalah
ja: 問題報告を作成

# issueReportCreateIssueReportSubtitle
source: Add a new issueReport
id: Tambah laporan masalah baru
ja: 新しい問題報告を追加

# issueReportSelectManyTitle
source: Select Many
id: Pilih Banyak
ja: 複数選択

# issueReportSelectManySubtitle
source: Select multiple issueReports to delete
id: Pilih beberapa laporan masalah untuk dihapus
ja: 削除する複数の問題報告を選択

# issueReportFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# issueReportFilterAndSortSubtitle
source: Customize issueReport display
id: Sesuaikan tampilan laporan masalah
ja: 問題報告表示をカスタマイズ

# issueReportSelectIssueReportsToDelete
source: Select issueReports to delete
id: Pilih laporan masalah untuk dihapus
ja: 削除する問題報告を選択

# issueReportDeleteIssueReports
source: Delete IssueReports
id: Hapus Laporan Masalah
ja: 問題報告を削除

# issueReportDeleteMultipleConfirmation
source: Are you sure you want to delete {count} issueReports?
id: Apakah Anda yakin ingin menghapus {count} laporan masalah?
ja: {count}個の問題報告を削除してもよろしいですか？

# issueReportNoIssueReportsSelected
source: No issueReports selected
id: Tidak ada laporan masalah yang dipilih
ja: 問題報告が選択されていません

# issueReportNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# issueReportSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}個選択済み

# issueReportSearchIssueReports
source: Search issueReports...
id: Cari laporan masalah...
ja: 問題報告を検索...

# issueReportNoIssueReportsFound
source: No issueReports found
id: Tidak ada laporan masalah ditemukan
ja: 問題報告が見つかりません

# issueReportCreateFirstIssueReport
source: Create your first issueReport to get started
id: Buat laporan masalah pertama Anda untuk memulai
ja: 最初の問題報告を作成して開始しましょう

# issueReportLongPressToSelect
source: Long press to select more issueReports
id: Tekan lama untuk memilih lebih banyak laporan masalah
ja: 長押ししてさらに問題報告を選択

# issueReportFilterByAsset
source: Filter by Asset
id: Filter berdasarkan Aset
ja: 資産でフィルター

# issueReportFilterByReportedBy
source: Filter by Reported By
id: Filter berdasarkan Dilaporkan Oleh
ja: 報告者でフィルター

# issueReportFilterByResolvedBy
source: Filter by Resolved By
id: Filter berdasarkan Diselesaikan Oleh
ja: 解決者でフィルター

# issueReportSearchAssetFilter
source: Search asset...
id: Cari aset...
ja: 資産を検索...

# issueReportSearchUserFilter
source: Search user...
id: Cari pengguna...
ja: ユーザーを検索...

# issueReportEnterIssueTypeFilter
source: Enter issue type...
id: Masukkan jenis masalah...
ja: 問題タイプを入力...

# issueReportSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# issueReportSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# issueReportIsResolved
source: Is Resolved
id: Sudah Diselesaikan
ja: 解決済み

# issueReportDateFrom
source: Date From
id: Tanggal Dari
ja: 開始日

# issueReportDateTo
source: Date To
id: Tanggal Sampai
ja: 終了日

# issueReportReset
source: Reset
ja: リセット

# issueReportApply
source: Apply
id: Terapkan
ja: 適用

# issueReportFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# issueReportFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# issueReportMyIssueReports
source: My Issue Reports
id: Laporan Masalah Saya
ja: 私の問題報告

# issueReportSearchMyIssueReports
source: Search my issue reports...
id: Cari laporan masalah saya...
ja: 私の問題報告を検索...

# issueReportFiltersAndSorting
source: Filters & Sorting
id: Filter & Pengurutan
ja: フィルターと並べ替え

# issueReportApplyFilters
source: Apply Filters
id: Terapkan Filter
ja: フィルターを適用

# issueReportFiltersApplied
source: Filters Applied
id: Filter Diterapkan
ja: フィルター適用済み

# issueReportFilterAndSort
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# issueReportNoIssueReportsFoundEmpty
source: No issue reports found
id: Tidak ada laporan masalah ditemukan
ja: 問題報告が見つかりません

# issueReportYouHaveNoReportedIssues
source: You have no reported issues
id: Anda tidak memiliki laporan masalah
ja: 報告された問題はありません

# issueReportCreateIssueReportTooltip
source: Create Issue Report
id: Buat Laporan Masalah
ja: 問題報告を作成

# issueReportValidationAssetRequired
source: Asset is required
id: Aset wajib diisi
ja: 資産は必須です

# issueReportValidationReportedByRequired
source: Reported by is required
id: Dilaporkan oleh wajib diisi
ja: 報告者は必須です

# issueReportValidationIssueTypeRequired
source: Issue type is required
id: Jenis masalah wajib diisi
ja: 問題タイプは必須です

# issueReportValidationIssueTypeMaxLength
source: Issue type must not exceed 100 characters
id: Jenis masalah maksimal 100 karakter
ja: 問題タイプは100文字を超えることはできません

# issueReportValidationPriorityRequired
source: Priority is required
id: Prioritas wajib diisi
ja: 優先度は必須です

# issueReportValidationStatusRequired
source: Status is required
id: Status wajib diisi
ja: ステータスは必須です

# issueReportValidationTitleRequired
source: Title is required
id: Judul wajib diisi
ja: タイトルは必須です

# issueReportValidationTitleMaxLength
source: Title must not exceed 200 characters
id: Judul maksimal 200 karakter
ja: タイトルは200文字を超えることはできません

# issueReportValidationDescriptionMaxLength
source: Description must not exceed 1000 characters
id: Deskripsi maksimal 1000 karakter
ja: 説明は1000文字を超えることはできません

# issueReportValidationResolutionNotesMaxLength
source: Resolution notes must not exceed 1000 characters
id: Catatan resolusi maksimal 1000 karakter
ja: 解決メモは1000文字を超えることはできません

# locationDeleteLocation
source: Delete Location
id: Hapus Lokasi
ja: 場所を削除

# locationDeleteConfirmation
source: Are you sure you want to delete "{locationName}"?
id: Apakah Anda yakin ingin menghapus "{locationName}"?
ja: "{locationName}"を削除してもよろしいですか？

# locationCancel
source: Cancel
id: Batal
ja: キャンセル

# locationDelete
source: Delete
id: Hapus
ja: 削除

source: Location Detail
id: Detail Lokasi
ja: 場所詳細

source: Location Information
id: Informasi Lokasi
ja: 場所情報

source: Location Code
id: Kode Lokasi
ja: 場所コード

source: Location Name
id: Nama Lokasi
ja: 場所名

# locationBuilding
source: Building
id: Gedung
ja: 建物

# locationFloor
source: Floor
id: Lantai
ja: 階

# locationLatitude
source: Latitude
id: Lintang
ja: 緯度

# locationLongitude
source: Longitude
id: Bujur
ja: 経度

# locationMetadata
source: Metadata
ja: メタデータ

# locationCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# locationUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# locationOnlyAdminCanEdit
source: Only admin can edit locations
id: Hanya admin yang dapat mengedit lokasi
ja: 場所を編集できるのは管理者のみです

# locationOnlyAdminCanDelete
source: Only admin can delete locations
id: Hanya admin yang dapat menghapus lokasi
ja: 場所を削除できるのは管理者のみです

# locationFailedToLoad
source: Failed to load location
id: Gagal memuat lokasi
ja: 場所の読み込みに失敗しました

source: Location deleted
id: Lokasi dihapus
ja: 場所が削除されました

# locationDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# locationEditLocation
source: Edit Location
id: Edit Lokasi
ja: 場所を編集

# locationCreateLocation
source: Create Location
id: Buat Lokasi
ja: 場所を作成

# locationFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須フィールドをすべて入力してください

source: Location saved successfully
id: Lokasi berhasil disimpan
ja: 場所が正常に保存されました

# locationOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# locationFailedToLoadTranslations
source: Failed to load translations
id: Gagal memuat terjemahan
ja: 翻訳の読み込みに失敗しました

# locationEnterLocationCode
source: Enter location code (e.g., LOC-001)
id: Masukkan kode lokasi (contoh: LOC-001)
ja: 場所コードを入力 (例: LOC-001)

# locationBuildingOptional
source: Building (Optional)
id: Gedung (Opsional)
ja: 建物 (オプション)

# locationEnterBuilding
source: Enter building name
id: Masukkan nama gedung
ja: 建物名を入力

# locationFloorOptional
source: Floor (Optional)
id: Lantai (Opsional)
ja: 階 (オプション)

# locationEnterFloor
source: Enter floor number
id: Masukkan nomor lantai
ja: 階数を入力

# locationLatitudeOptional
source: Latitude (Optional)
id: Lintang (Opsional)
ja: 緯度 (オプション)

# locationEnterLatitude
source: Enter latitude
id: Masukkan lintang
ja: 緯度を入力

# locationLongitudeOptional
source: Longitude (Optional)
id: Bujur (Opsional)
ja: 経度 (オプション)

# locationEnterLongitude
source: Enter longitude
id: Masukkan bujur
ja: 経度を入力

# locationGettingLocation
source: Getting Location...
id: Mendapatkan Lokasi...
ja: 位置情報取得中...

# locationUseCurrentLocation
source: Use Current Location
id: Gunakan Lokasi Saat Ini
ja: 現在位置を使用

# locationServicesDisabled
source: Location services are disabled
id: Layanan lokasi dinonaktifkan
ja: 位置情報サービスが無効です

# locationServicesDialogTitle
source: Location Services Disabled
id: Layanan Lokasi Dinonaktifkan
ja: 位置情報サービスが無効です

# locationServicesDialogMessage
source: Location services are required to get your current location. Would you like to enable them?
id: Layanan lokasi diperlukan untuk mendapatkan lokasi Anda saat ini. Apakah Anda ingin mengaktifkannya?
ja: 現在位置を取得するには位置情報サービスが必要です。有効にしますか？

# locationOpenSettings
source: Open Settings
id: Buka Pengaturan
ja: 設定を開く

source: Location permission denied
id: Izin lokasi ditolak
ja: 位置情報許可が拒否されました

source: Location permission permanently denied
id: Izin lokasi ditolak secara permanen
ja: 位置情報許可が永続的に拒否されました

# locationPermissionRequired
source: Permission Required
id: Izin Diperlukan
ja: 許可が必要です

# locationPermissionDialogMessage
source: Location permission is permanently denied. Please enable it in app settings.
id: Izin lokasi ditolak secara permanen. Silakan aktifkan di pengaturan aplikasi.
ja: 位置情報許可が永続的に拒否されています。アプリ設定で有効にしてください。

# locationRetrievedSuccessfully
source: Current location retrieved successfully
id: Lokasi saat ini berhasil didapatkan
ja: 現在位置を正常に取得しました

# locationFailedToGetCurrent
source: Failed to get current location
id: Gagal mendapatkan lokasi saat ini
ja: 現在位置の取得に失敗しました

# locationTranslations
source: Translations
id: Terjemahan
ja: 翻訳

# locationTranslationsSubtitle
source: Add translations for different languages
id: Tambahkan terjemahan untuk bahasa yang berbeda
ja: さまざまな言語の翻訳を追加

# locationEnglish
source: English
id: Inggris
ja: 英語

# locationJapanese
source: Japanese
id: Jepang
ja: 日本語

# locationIndonesian
source: Indonesian
id: Indonesia
ja: インドネシア語

# locationEnterLocationName
source: Enter location name
id: Masukkan nama lokasi
ja: 場所名を入力

# locationUpdate
source: Update
id: Perbarui
ja: 更新

# locationCreate
source: Create
id: Buat
ja: 作成

source: Location Management
id: Manajemen Lokasi
ja: 場所管理

# locationCreateLocationTitle
source: Create Location
id: Buat Lokasi
ja: 場所を作成

# locationCreateLocationSubtitle
source: Add a new location
id: Tambah lokasi baru
ja: 新しい場所を追加

# locationSelectManyTitle
source: Select Many
id: Pilih Banyak
ja: 複数選択

# locationSelectManySubtitle
source: Select multiple locations to delete
id: Pilih beberapa lokasi untuk dihapus
ja: 削除する複数の場所を選択

# locationFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# locationFilterAndSortSubtitle
source: Customize location display
id: Sesuaikan tampilan lokasi
ja: 場所表示をカスタマイズ

# locationSelectLocationsToDelete
source: Select locations to delete
id: Pilih lokasi untuk dihapus
ja: 削除する場所を選択

# locationSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# locationSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# locationReset
source: Reset
ja: リセット

# locationApply
source: Apply
id: Terapkan
ja: 適用

# locationFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# locationFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# locationDeleteLocations
source: Delete Locations
id: Hapus Lokasi
ja: 場所を削除

# locationDeleteMultipleConfirmation
source: Are you sure you want to delete {count} locations?
id: Apakah Anda yakin ingin menghapus {count} lokasi?
ja: {count}個の場所を削除してもよろしいですか？

# locationNoLocationsSelected
source: No locations selected
id: Tidak ada lokasi yang dipilih
ja: 場所が選択されていません

# locationNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# locationSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}個選択済み

# locationSearchLocations
source: Search locations...
id: Cari lokasi...
ja: 場所を検索...

# locationNoLocationsFound
source: No locations found
id: Tidak ada lokasi ditemukan
ja: 場所が見つかりません

# locationCreateFirstLocation
source: Create your first location to get started
id: Buat lokasi pertama Anda untuk memulai
ja: 最初の場所を作成して開始しましょう

# locationLongPressToSelect
source: Long press to select more locations
id: Tekan lama untuk memilih lebih banyak lokasi
ja: 長押ししてさらに場所を選択

# locationFloorPrefix
source: Floor {floor}
id: Lantai {floor}
ja: {floor}階

# locationValidationCodeRequired
source: Location code is required
id: Kode lokasi wajib diisi
ja: 場所コードは必須です

# locationValidationCodeMinLength
source: Location code must be at least 2 characters
id: Kode lokasi minimal 2 karakter
ja: 場所コードは2文字以上である必要があります

# locationValidationCodeMaxLength
source: Location code must not exceed 20 characters
id: Kode lokasi maksimal 20 karakter
ja: 場所コードは20文字を超えることはできません

# locationValidationCodeAlphanumeric
source: Location code can only contain letters, numbers, and dashes
id: Kode lokasi hanya boleh mengandung huruf, angka, dan tanda hubung
ja: 場所コードには英数字とダッシュのみ使用できます

# locationValidationNameRequired
source: Location name is required
id: Nama lokasi wajib diisi
ja: 場所名は必須です

# locationValidationNameMinLength
source: Location name must be at least 3 characters
id: Nama lokasi minimal 3 karakter
ja: 場所名は3文字以上である必要があります

# locationValidationNameMaxLength
source: Location name must not exceed 100 characters
id: Nama lokasi maksimal 100 karakter
ja: 場所名は100文字を超えることはできません

# locationValidationBuildingMaxLength
source: Building must not exceed 50 characters
id: Gedung maksimal 50 karakter
ja: 建物は50文字を超えることはできません

# locationValidationFloorMaxLength
source: Floor must not exceed 20 characters
id: Lantai maksimal 20 karakter
ja: 階は20文字を超えることはできません

# locationValidationLatitudeInvalid
source: Latitude must be a valid number
id: Lintang harus berupa angka valid
ja: 緯度は有効な数値である必要があります

# locationValidationLatitudeRange
source: Latitude must be between -90 and 90
id: Lintang harus antara -90 dan 90
ja: 緯度は-90から90の間である必要があります

# locationValidationLongitudeInvalid
source: Longitude must be a valid number
id: Bujur harus berupa angka valid
ja: 経度は有効な数値である必要があります

# locationValidationLongitudeRange
source: Longitude must be between -180 and 180
id: Bujur harus antara -180 dan 180
ja: 経度は-180から180の間である必要があります

source: Location not found
id: Lokasi tidak ditemukan
ja: 場所が見つかりません

# locationSearchFailed
source: Search failed
id: Pencarian gagal
ja: 検索に失敗しました

# locationConfirmLocation
source: Confirm Location
id: Konfirmasi Lokasi
ja: 場所を確認

source: Location selected from map
id: Lokasi dipilih dari peta
ja: マップから場所を選択しました

# locationSearchLocation
source: Search location...
id: Cari lokasi...
ja: 場所を検索...

# locationPickFromMap
source: Pick from map
id: Pilih dari peta
ja: マップから選択

# maintenanceScheduleDeleteSchedule
source: Delete Maintenance Schedule
id: Hapus Jadwal Pemeliharaan
ja: メンテナンススケジュールの削除

# maintenanceScheduleDeleteConfirmation
source: Are you sure you want to delete "{title}"?
id: Apakah Anda yakin ingin menghapus "{title}"?
ja: 「{title}」を削除してもよろしいですか？

source: Maintenance schedule deleted
id: Jadwal pemeliharaan dihapus
ja: メンテナンススケジュールを削除しました

# maintenanceScheduleDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

source: Maintenance Schedule Detail
id: Detail Jadwal Pemeliharaan
ja: メンテナンススケジュール詳細

source: Maintenance Schedule Information
id: Informasi Jadwal Pemeliharaan
ja: メンテナンススケジュール情報

# maintenanceScheduleTitle
source: Title
id: Judul
ja: タイトル

# maintenanceScheduleDescription
source: Description
id: Deskripsi
ja: 説明

# maintenanceScheduleAsset
source: Asset
id: Aset
ja: 資産

# maintenanceScheduleMaintenanceType
source: Maintenance Type
id: Jenis Pemeliharaan
ja: メンテナンスタイプ

# maintenanceScheduleIsRecurring
source: Is Recurring
id: Berulang
ja: 定期実行

# maintenanceScheduleInterval
source: Interval
ja: 間隔

# maintenanceScheduleScheduledTime
source: Scheduled Time
id: Waktu Terjadwal
ja: 予定時刻

# maintenanceScheduleNextScheduledDate
source: Next Scheduled Date
id: Tanggal Terjadwal Berikutnya
ja: 次回実行予定日

# maintenanceScheduleLastExecutedDate
source: Last Executed Date
id: Tanggal Eksekusi Terakhir
ja: 前回実行日

# maintenanceScheduleState
source: State
id: Status
ja: 状態

# maintenanceScheduleAutoComplete
source: Auto Complete
id: Selesai Otomatis
ja: 自動完了

# maintenanceScheduleEstimatedCost
source: Estimated Cost
id: Estimasi Biaya
ja: 予想コスト

# maintenanceScheduleCreatedBy
source: Created By
id: Dibuat Oleh
ja: 作成者

# maintenanceScheduleYes
source: Yes
id: Ya
ja: はい

# maintenanceScheduleNo
source: No
id: Tidak
ja: いいえ

# maintenanceScheduleUnknownAsset
source: Unknown Asset
id: Aset Tidak Diketahui
ja: 不明な資産

# maintenanceScheduleUnknownUser
source: Unknown User
id: Pengguna Tidak Diketahui
ja: 不明なユーザー

# maintenanceScheduleOnlyAdminCanEdit
source: Only admin can edit maintenance schedules
id: Hanya admin yang dapat mengedit jadwal pemeliharaan
ja: 管理者のみがメンテナンススケジュールを編集できます

# maintenanceScheduleOnlyAdminCanDelete
source: Only admin can delete maintenance schedules
id: Hanya admin yang dapat menghapus jadwal pemeliharaan
ja: 管理者のみがメンテナンススケジュールを削除できます

# maintenanceScheduleFailedToLoad
source: Failed to load maintenance schedule
id: Gagal memuat jadwal pemeliharaan
ja: メンテナンススケジュールの読み込みに失敗しました

# maintenanceScheduleEditSchedule
source: Edit Maintenance Schedule
id: Edit Jadwal Pemeliharaan
ja: メンテナンススケジュールの編集

# maintenanceScheduleCreateSchedule
source: Create Maintenance Schedule
id: Buat Jadwal Pemeliharaan
ja: メンテナンススケジュールの作成

# maintenanceScheduleFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須項目をすべて入力してください

source: Maintenance schedule saved successfully
id: Jadwal pemeliharaan berhasil disimpan
ja: メンテナンススケジュールを正常に保存しました
