Repository: Rizz404/sigma_track
Catalog: lib/l10n/app_*.arb
Languages: id, ja

# assetDeleteAsset
source: Delete Asset
id: Hapus Aset
ja: 資産を削除

# assetDeleteConfirmation
source: Are you sure you want to delete "{assetName}"?
id: Apakah Anda yakin ingin menghapus "{assetName}"?
ja: "{assetName}"を削除してもよろしいですか？

# assetCancel
source: Cancel
id: Batal
ja: キャンセル

# assetDelete
source: Delete
id: Hapus
ja: 削除

source: Asset Detail
id: Detail Aset
ja: 資産詳細

source: Asset Information
id: Informasi Aset
ja: 資産情報

source: Asset Tag
id: Tag Aset
ja: 資産タグ

source: Asset Name
id: Nama Aset
ja: 資産名

# assetCategory
source: Category
id: Kategori
ja: カテゴリ

# assetBrand
source: Brand
id: Merek
ja: ブランド

# assetBrandLabel
source: Brand
id: Merek
ja: ブランド

# assetModel
source: Model
ja: モデル

# assetModelLabel
source: Model
ja: モデル

# assetSerialNumber
source: Serial Number
id: Nomor Seri
ja: シリアル番号

# assetStatus
source: Status
ja: ステータス

# assetCondition
source: Condition
id: Kondisi
ja: 状態

# assetLocation
source: Location
id: Lokasi
ja: 場所

# assetAssignedTo
source: Assigned To
id: Ditugaskan Kepada
ja: 割り当て先

# assetPurchaseInformation
source: Purchase Information
id: Informasi Pembelian
ja: 購入情報

# assetPurchaseDate
source: Purchase Date
id: Tanggal Pembelian
ja: 購入日

# assetPurchasePrice
source: Purchase Price
id: Harga Pembelian
ja: 購入価格

# assetVendorName
source: Vendor Name
id: Nama Vendor
ja: ベンダー名

# assetWarrantyEnd
source: Warranty End
id: Berakhir Garansi
ja: 保証終了

# assetMetadata
source: Metadata
ja: メタデータ

# assetCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# assetUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# assetDataMatrixImage
source: Data Matrix Image
id: Gambar Data Matrix
ja: データマトリックス画像

# assetOnlyAdminCanEdit
source: Only admin can edit assets
id: Hanya admin yang dapat mengedit aset
ja: 資産を編集できるのは管理者のみです

# assetOnlyAdminCanDelete
source: Only admin can delete assets
id: Hanya admin yang dapat menghapus aset
ja: 資産を削除できるのは管理者のみです

# assetFailedToLoad
source: Failed to load asset
id: Gagal memuat aset
ja: 資産の読み込みに失敗しました

# assetLocationPermissionRequired
source: Location Permission Required
id: Izin Lokasi Diperlukan
ja: 位置情報許可が必要です

# assetLocationPermissionMessage
source: Location access is needed to track scan logs. Please enable it in settings.
id: Akses lokasi diperlukan untuk melacak log pemindaian. Silakan aktifkan di pengaturan.
ja: スキャンログを追跡するには位置情報アクセスが必要です。設定で有効にしてください。

# assetOpenSettings
source: Open Settings
id: Buka Pengaturan
ja: 設定を開く

# assetLocationPermissionNeeded
source: Location permission needed for scan logs
id: Izin lokasi diperlukan untuk log pemindaian
ja: スキャンログには位置情報許可が必要です

# assetInvalidBarcode
source: Invalid barcode data
id: Data barcode tidak valid
ja: 無効なバーコードデータ

# assetFound
source: Asset found: {assetName}
id: Aset ditemukan: {assetName}
ja: 資産が見つかりました: {assetName}

source: Asset not found
id: Aset tidak ditemukan
ja: 資産が見つかりません

# assetFailedToProcessBarcode
source: Failed to process barcode
id: Gagal memproses barcode
ja: バーコードの処理に失敗しました

# assetCameraError
source: Camera Error
id: Kesalahan Kamera
ja: カメラエラー

# assetAlignDataMatrix
source: Align data matrix within frame
id: Sejajarkan data matrix dalam bingkai
ja: データマトリックスをフレーム内に揃えてください

# assetProcessing
source: Processing...
id: Memproses...
ja: 処理中...

# assetFlash
source: Flash
ja: フラッシュ

# assetFlip
source: Flip
id: Balik
ja: 反転

# assetEditAsset
source: Edit Asset
id: Edit Aset
ja: 資産を編集

# assetCreateAsset
source: Create Asset
id: Buat Aset
ja: 資産を作成

# assetFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須フィールドをすべて入力してください

# assetSelectCategory
source: Please select a category
id: Harap pilih kategori
ja: カテゴリを選択してください

source: Asset saved successfully
id: Aset berhasil disimpan
ja: 資産が正常に保存されました

# assetOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# assetDeletedSuccess
source: Asset deleted
id: Aset dihapus
ja: 資産が削除されました

# assetDeletedFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# assetFailedToGenerateDataMatrix
source: Failed to generate data matrix
id: Gagal membuat data matrix
ja: データマトリックスの生成に失敗しました

# assetSelectCategoryFirst
source: Please select a category first
id: Harap pilih kategori terlebih dahulu
ja: まずカテゴリを選択してください

# assetTagGenerated
source: Asset tag generated: {tag}
id: Tag aset dibuat: {tag}
ja: 資産タグが生成されました: {tag}

# assetFailedToGenerateTag
source: Failed to generate asset tag
id: Gagal membuat tag aset
ja: 資産タグの生成に失敗しました

# assetSelectImages
source: Select Images
id: Pilih Gambar
ja: 画像を選択

# assetTemplateImagesHint
source: Upload images that will be used for this asset
id: Unggah gambar yang akan digunakan untuk aset ini
ja: このアセットに使用する画像をアップロードしてください

# assetImagesSelected
source: {count} images selected
id: {count} gambar dipilih
ja: {count}枚の画像が選択されました

# assetClearImages
source: Clear
id: Hapus
ja: クリア

# assetSelectTemplateImages
source: Select Template Images
id: Pilih Gambar Template
ja: テンプレート画像を選択

# assetEnterAssetTagFirst
source: Please enter asset tag first
id: Harap masukkan tag aset terlebih dahulu
ja: まず資産タグを入力してください

# assetBasicInformation
source: Basic Information
id: Informasi Dasar
ja: 基本情報

# assetEnterAssetTag
source: Enter asset tag (e.g., AST-001)
id: Masukkan tag aset (contoh: AST-001)
ja: 資産タグを入力 (例: AST-001)

# assetAutoGenerateTag
source: Auto-generate asset tag
id: Buat tag aset otomatis
ja: 資産タグを自動生成

# assetEnterAssetName
source: Enter asset name
id: Masukkan nama aset
ja: 資産名を入力

# assetBrandOptional
source: Brand (Optional)
id: Merek (Opsional)
ja: ブランド (オプション)

# assetEnterBrand
source: Enter brand name
id: Masukkan nama merek
ja: ブランド名を入力

# assetModelOptional
source: Model (Optional)
id: Model (Opsional)
ja: モデル (オプション)

# assetEnterModel
source: Enter model
id: Masukkan model
ja: モデルを入力

# assetSerialNumberOptional
source: Serial Number (Optional)
id: Nomor Seri (Opsional)
ja: シリアル番号 (オプション)

# assetEnterSerialNumber
source: Enter serial number
id: Masukkan nomor seri
ja: シリアル番号を入力

# assetDataMatrixPreview
source: Data Matrix Preview
id: Pratinjau Data Matrix
ja: データマトリックスプレビュー

# assetRegenerateDataMatrix
source: Regenerate Data Matrix
id: Buat Ulang Data Matrix
ja: データマトリックスを再生成

# assetCategoryAndLocation
source: Category & Location
id: Kategori & Lokasi
ja: カテゴリと場所

# assetSearchCategory
source: Search category...
id: Cari kategori...
ja: カテゴリを検索...

# assetNotSet
source: Not set
id: Tidak diatur
ja: 未設定

# assetChangeLocationInstruction
source: To change location, use Asset Movement screen
id: Untuk mengubah lokasi, gunakan layar Perpindahan Aset
ja: 場所を変更するには、資産移動画面を使用してください

# assetLocationOptional
source: Location (Optional)
id: Lokasi (Opsional)
ja: 場所 (オプション)

# assetSearchLocation
source: Search location...
id: Cari lokasi...
ja: 場所を検索...

# assetNotAssigned
source: Not assigned
id: Tidak ditugaskan
ja: 未割り当て

# assetChangeAssignmentInstruction
source: To change assignment, use Asset Movement screen
id: Untuk mengubah penugasan, gunakan layar Perpindahan Aset
ja: 割り当てを変更するには、資産移動画面を使用してください

# assetAssignedToOptional
source: Assigned To (Optional)
id: Ditugaskan Kepada (Opsional)
ja: 割り当て先 (オプション)

# assetSearchUser
source: Search user...
id: Cari pengguna...
ja: ユーザーを検索...

# assetPurchaseDateOptional
source: Purchase Date (Optional)
id: Tanggal Pembelian (Opsional)
ja: 購入日 (オプション)

# assetEnterPurchasePrice
source: Enter purchase price
id: Masukkan harga pembelian
ja: 購入価格を入力

# assetVendorNameOptional
source: Vendor Name (Optional)
id: Nama Vendor (Opsional)
ja: ベンダー名 (オプション)

# assetEnterVendorName
source: Enter vendor name
id: Masukkan nama vendor
ja: ベンダー名を入力

# assetWarrantyEndDateOptional
source: Warranty End Date (Optional)
id: Tanggal Berakhir Garansi (Opsional)
ja: 保証終了日 (オプション)

# assetWarrantyDuration
source: Warranty Duration (Auto-calculate)
id: Durasi Garansi (Auto-hitung)
ja: 保証期間 (自動計算)

# assetWarrantyDurationHelper
source: Auto-calculate warranty end from purchase date
id: Auto-hitung akhir garansi dari tanggal pembelian
ja: 購入日から保証終了日を自動計算

# assetEnterDuration
source: Enter duration
id: Masukkan durasi
ja: 期間を入力

# assetMonth
source: Month
id: Bulan
ja: ヶ月

# assetMonths
source: Months
id: Bulan
ja: ヶ月

# assetYear
source: Year
id: Tahun
ja: 年

# assetYears
source: Years
id: Tahun
ja: 年

# assetSelectPeriod
source: Select period
id: Pilih periode
ja: 期間を選択

# assetStatusAndCondition
source: Status & Condition
id: Status & Kondisi
ja: ステータスと状態

# assetSelectStatus
source: Select status
id: Pilih status
ja: ステータスを選択

# assetSelectCondition
source: Select condition
id: Pilih kondisi
ja: 状態を選択

# assetUpdate
source: Update
id: Perbarui
ja: 更新

# assetCreate
source: Create
id: Buat
ja: 作成

# assetCreateAssetTitle
source: Create Asset
id: Buat Aset
ja: 資産を作成

# assetCreateAssetSubtitle
source: Add a new asset
id: Tambah aset baru
ja: 新しい資産を追加

# assetSelectManyTitle
source: Select Many
id: Pilih Banyak
ja: 複数選択

# assetSelectManySubtitle
source: Select multiple assets to delete
id: Pilih beberapa aset untuk dihapus
ja: 削除する複数の資産を選択

# assetFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# assetFilterAndSortSubtitle
source: Customize asset display
id: Sesuaikan tampilan aset
ja: 資産表示をカスタマイズ

# assetFilterByCategory
source: Filter by Category
id: Filter berdasarkan Kategori
ja: カテゴリでフィルター

# assetFilterByLocation
source: Filter by Location
id: Filter berdasarkan Lokasi
ja: 場所でフィルター

# assetFilterByAssignedTo
source: Filter by Assigned To
id: Filter berdasarkan Ditugaskan Kepada
ja: 割り当て先でフィルター

# assetEnterBrandFilter
source: Enter brand...
id: Masukkan merek...
ja: ブランドを入力...

# assetEnterModelFilter
source: Enter model...
id: Masukkan model...
ja: モデルを入力...

# assetSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# assetSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# assetReset
source: Reset
ja: リセット

# assetApply
source: Apply
id: Terapkan
ja: 適用

# assetFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# assetFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

source: Asset Management
id: Manajemen Aset
ja: 資産管理

# assetSelectAssetsToDelete
source: Select assets to delete
id: Pilih aset untuk dihapus
ja: 削除する資産を選択

# assetDeleteAssets
source: Delete Assets
id: Hapus Aset
ja: 資産を削除

# assetDeleteMultipleConfirmation
source: Are you sure you want to delete {count} assets?
id: Apakah Anda yakin ingin menghapus {count} aset?
ja: {count}個の資産を削除してもよろしいですか？

# assetNoAssetsSelected
source: No assets selected
id: Tidak ada aset yang dipilih
ja: 資産が選択されていません

# assetNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# assetSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}個選択済み

# assetSearchAssets
source: Search assets...
id: Cari aset...
ja: 資産を検索...

# assetNoAssetsFound
source: No assets found
id: Tidak ada aset ditemukan
ja: 資産が見つかりません

# assetCreateFirstAsset
source: Create your first asset to get started
id: Buat aset pertama Anda untuk memulai
ja: 最初の資産を作成して開始しましょう

# assetLongPressToSelect
source: Long press to select more assets
id: Tekan lama untuk memilih lebih banyak aset
ja: 長押ししてさらに資産を選択

# assetFiltersAndSorting
source: Filters & Sorting
id: Filter & Pengurutan
ja: フィルターと並べ替え

# assetApplyFilters
source: Apply Filters
id: Terapkan Filter
ja: フィルターを適用

# assetMyAssets
source: My Assets
id: Aset Saya
ja: 私の資産

# assetSearchMyAssets
source: Search my assets...
id: Cari aset saya...
ja: 私の資産を検索...

# assetFiltersApplied
source: Filters Applied
id: Filter Diterapkan
ja: フィルター適用済み

# assetNoAssignedAssets
source: You have no assigned assets
id: Anda tidak memiliki aset yang ditugaskan
ja: 割り当てられた資産がありません

# assetExportAssets
source: Export Assets
id: Ekspor Aset
ja: 資産をエクスポート

# assetExportFormat
source: Export Format
id: Format Ekspor
ja: エクスポート形式

# assetIncludeDataMatrixImages
source: Include Data Matrix Images
id: Sertakan Gambar Data Matrix
ja: データマトリックス画像を含める

# assetExportReady
source: Export Ready
id: Ekspor Siap
ja: エクスポート準備完了

# assetExportSize
source: Size: {size} KB
id: Ukuran: {size} KB
ja: サイズ: {size} KB

# assetExportFormatDisplay
source: Format: {format}
ja: 形式: {format}

# assetExportShareInstruction
source: File will open share menu. Choose app to open or save directly.
id: File akan membuka menu berbagi. Pilih aplikasi untuk membuka atau simpan langsung.
ja: ファイルが共有メニューを開きます。開くアプリを選択するか、直接保存してください。

# assetShareAndSave
source: Save
id: Simpan
ja: 保存

# assetExportSubject
source: Assets Export
id: Ekspor Aset
ja: 資産エクスポート

# assetSaveToDownloads
source: Save to Downloads?
id: Simpan ke Downloads?
ja: ダウンロードに保存しますか？

# assetSaveToDownloadsMessage
source: File has been shared. Would you like to save a copy to Downloads folder?
id: File telah dibagikan. Apakah Anda ingin menyimpan salinan ke folder Downloads?
ja: ファイルが共有されました。ダウンロードフォルダにコピーを保存しますか？

# assetNo
source: No
id: Tidak
ja: いいえ

# assetSave
source: Save
id: Simpan
ja: 保存

# assetFileSharedSuccessfully
source: File shared successfully
id: File berhasil dibagikan
ja: ファイルが正常に共有されました

# assetShareCancelled
source: Share cancelled
id: Berbagi dibatalkan
ja: 共有がキャンセルされました

# assetFailedToShareFile
source: Failed to share file: {error}
id: Gagal berbagi file: {error}
ja: ファイルの共有に失敗しました: {error}

# assetFileSavedSuccessfully
source: File saved successfully to Downloads
id: File berhasil disimpan ke Downloads
ja: ファイルがダウンロードに正常に保存されました

# assetFailedToSaveFile
source: Failed to save file: {error}
id: Gagal menyimpan file: {error}
ja: ファイルの保存に失敗しました: {error}

# assetValidationTagRequired
source: Asset tag is required
id: Tag aset wajib diisi
ja: 資産タグは必須です

# assetValidationTagMinLength
source: Asset tag must be at least 3 characters
id: Tag aset minimal 3 karakter
ja: 資産タグは3文字以上である必要があります

# assetValidationTagMaxLength
source: Asset tag must not exceed 50 characters
id: Tag aset maksimal 50 karakter
ja: 資産タグは50文字を超えることはできません

# assetValidationTagAlphanumeric
source: Asset tag can only contain letters, numbers, and dashes
id: Tag aset hanya boleh mengandung huruf, angka, dan tanda hubung
ja: 資産タグには英数字とダッシュのみ使用できます

# assetValidationNameRequired
source: Asset name is required
id: Nama aset wajib diisi
ja: 資産名は必須です

# assetValidationNameMinLength
source: Asset name must be at least 3 characters
id: Nama aset minimal 3 karakter
ja: 資産名は3文字以上である必要があります

# assetValidationNameMaxLength
source: Asset name must not exceed 100 characters
id: Nama aset maksimal 100 karakter
ja: 資産名は100文字を超えることはできません

# assetValidationCategoryRequired
source: Category is required
id: Kategori wajib diisi
ja: カテゴリは必須です

# assetValidationBrandMaxLength
source: Brand must not exceed 50 characters
id: Merek maksimal 50 karakter
ja: ブランドは50文字を超えることはできません

# assetValidationModelMaxLength
source: Model must not exceed 50 characters
id: Model maksimal 50 karakter
ja: モデルは50文字を超えることはできません

# assetValidationSerialMaxLength
source: Serial number must not exceed 50 characters
id: Nomor seri maksimal 50 karakter
ja: シリアル番号は50文字を超えることはできません

# assetValidationPriceInvalid
source: Purchase price must be a valid number
id: Harga pembelian harus berupa angka valid
ja: 購入価格は有効な数値である必要があります

# assetValidationPriceNegative
source: Purchase price cannot be negative
id: Harga pembelian tidak boleh negatif
ja: 購入価格は負の値にできません

# assetValidationVendorMaxLength
source: Vendor name must not exceed 100 characters
id: Nama vendor maksimal 100 karakter
ja: ベンダー名は100文字を超えることはできません

# assetExport
source: Export
id: Ekspor
ja: エクスポート

# assetSelectExportType
source: Select export type
id: Pilih jenis ekspor
ja: エクスポートタイプを選択

# assetExportList
source: Export List
id: Ekspor Daftar
ja: リストをエクスポート

# assetExportListSubtitle
source: Export assets as a list
id: Ekspor aset sebagai daftar
ja: 資産をリストとしてエクスポート

# assetExportDataMatrix
source: Export Data Matrix
id: Ekspor Data Matrix
ja: データマトリックスをエクスポート

# assetExportDataMatrixSubtitle
source: Export data matrix codes for assets
id: Ekspor kode data matrix untuk aset
ja: 資産のデータマトリックスコードをエクスポート

# assetDataMatrixPdfOnly
source: Data matrix export is only available in PDF format
id: Ekspor data matrix hanya tersedia dalam format PDF
ja: データマトリックスのエクスポートはPDF形式のみ利用可能です

# assetQuickActions
source: Quick Actions
id: Aksi Cepat
ja: クイックアクション

# assetReportIssue
source: Report Issue
id: Laporkan Masalah
ja: 問題を 報告

# assetMoveToUser
source: Move to User
id: Pindah ke Pengguna
ja: ユーザーに 移動

# assetMoveToLocation
source: Move to Location
id: Pindah ke Lokasi
ja: 場所に 移動

# assetScheduleMaintenance
source: Schedule Maint.
id: Jadwalkan Pemel.
ja: メンテを スケジュール

# assetRecordMaintenance
source: Record Maint.
id: Catat Pemel.
ja: メンテを 記録

# assetCopyAsset
source: Copy Asset
id: Salin Aset
ja: 資産を コピー

# assetExportTitle
source: Export
id: Ekspor
ja: エクスポート

# assetExportSubtitle
source: Export data to file
id: Ekspor data ke file
ja: データをファイルにエクスポート

# assetBulkCopy
source: Bulk Copy
id: Salin Massal
ja: 一括コピー

# assetBulkCopyDescription
source: Create multiple assets with the same data. Only asset tag, data matrix, and serial number will be different.
id: Buat beberapa aset dengan data yang sama. Hanya tag aset, data matrix, dan nomor seri yang akan berbeda.
ja: 同じデータで複数のアセットを作成します。アセットタグ、データマトリックス、シリアル番号のみが異なります。

# assetEnableBulkCopy
source: Enable bulk copy
id: Aktifkan salin massal
ja: 一括コピーを有効にする

# assetNumberOfCopies
source: Number of copies
id: Jumlah salinan
ja: コピー数

# assetEnterQuantity
source: Enter quantity
id: Masukkan jumlah
ja: 数量を入力

# assetPleaseEnterQuantity
source: Please enter quantity
id: Harap masukkan jumlah
ja: 数量を入力してください

# assetMinimumOneCopy
source: Minimum 1 copy
id: Minimal 1 salinan
ja: 最小1コピー

# assetMaximumCopies
source: Maximum 100 copies
id: Maksimal 100 salinan
ja: 最大100コピー

# assetSerialNumbersOptional
source: Serial Numbers (Optional)
id: Nomor Seri (Opsional)
ja: シリアル番号（オプション）

# assetEnterSerialNumbers
source: Enter serial numbers separated by comma or newline
id: Masukkan nomor seri dipisahkan dengan koma atau baris baru
ja: カンマまたは改行で区切ったシリアル番号を入力

# assetPleaseEnterCopyQuantity
source: Please enter copy quantity (minimum 1)
id: Harap masukkan jumlah salinan (minimal 1)
ja: コピー数を入力してください（最小1）

# assetEnterExactlySerialNumbers
source: Please enter exactly {quantity} serial numbers
id: Harap masukkan tepat {quantity} nomor seri
ja: 正確に{quantity}個のシリアル番号を入力してください

# assetDuplicateSerialNumbers
source: Duplicate serial numbers found
id: Ditemukan nomor seri duplikat
ja: 重複したシリアル番号が見つかりました

# assetSerialNumbersHint
source: Enter one serial number per line or separated by comma. Leave empty to skip serial numbers.
id: Masukkan satu nomor seri per baris atau dipisahkan dengan koma. Biarkan kosong untuk melewati nomor seri.
ja: 1行に1つのシリアル番号を入力するか、カンマで区切ります。シリアル番号をスキップする場合は空のままにしてください。

# assetBulkAutoGenerateInfo
source: Asset tags and data matrix will be auto-generated for each copy.
id: Tag aset dan data matrix akan dibuat secara otomatis untuk setiap salinan.
ja: アセットタグとデータマトリックスは各コピーに対して自動生成されます。

# assetCreatingBulkAssets
source: Creating Bulk Assets
id: Membuat Aset Massal
ja: 一括アセットを作成中

# assetCreateBulkAssets
source: Create Bulk Assets
id: Buat Aset Massal
ja: 一括アセットを作成

# assetGeneratingAssetTags
source: Generating asset tags...
id: Membuat tag aset...
ja: アセットタグを生成中...

# assetUploadingTemplateImages
source: Uploading template images...
id: Mengunggah gambar template...
ja: テンプレート画像をアップロード中...

# assetFailedToUploadTemplateImages
source: Failed to upload template images: {error}
id: Gagal mengunggah gambar template: {error}
ja: テンプレート画像のアップロードに失敗しました: {error}

# assetGeneratingDataMatrixImages
source: Generating data matrix images...
id: Membuat gambar data matrix...
ja: データマトリックス画像を生成中...

# assetGeneratedDataMatrix
source: Generated {current}/{total} data matrix images
id: Berhasil membuat {current}/{total} gambar data matrix
ja: {current}/{total}個のデータマトリックス画像を生成しました

# assetUploadingDataMatrix
source: Uploading {current}/{total} data matrix images...
id: Mengunggah {current}/{total} gambar data matrix...
ja: {current}/{total}個のデータマトリックス画像をアップロード中...

# assetUploadingDataMatrixProgress
source: Uploading data matrix images... {progress}%
id: Mengunggah gambar data matrix... {progress}%
ja: データマトリックス画像をアップロード中... {progress}%

# assetCreatingAssets
source: Creating assets...
id: Membuat aset...
ja: アセットを作成中...

# assetFailedToCreateBulkAssets
source: Failed to create bulk assets: {error}
id: Gagal membuat aset massal: {error}
ja: 一括アセットの作成に失敗しました: {error}

# assetAutoGenerationDisabled
source: Auto-generation disabled in bulk copy mode
id: Pembuatan otomatis dinonaktifkan dalam mode salin massal
ja: 一括コピーモードでは自動生成が無効になっています

# assetAutoGenerateAssetTag
source: Auto-generate asset tag
id: Buat tag aset secara otomatis
ja: アセットタグを自動生成

# assetCancelBulkProcessingTitle
source: Cancel Bulk Processing?
id: Batalkan Proses Massal?
ja: 一括処理をキャンセルしますか？

# assetCancelBulkProcessingMessage
source: Bulk asset creation is in progress. If you cancel now, all progress will be lost. Are you sure you want to cancel?
id: Pembuatan aset massal sedang berlangsung. Jika Anda membatalkan sekarang, semua progres akan hilang. Apakah Anda yakin ingin membatalkan?
ja: 一括資産作成が進行中です。今キャンセルすると、すべての進行状況が失われます。本当にキャンセルしますか？

# assetContinueProcessing
source: Continue
id: Lanjutkan
ja: 続行

# assetCancelProcessing
source: Cancel Processing
id: Batalkan Proses
ja: 処理をキャンセル

# assetRootCategory
source: Root Category
ja: ルートカテゴリ

# assetReuseExistingImages
source: Reuse Existing Images
ja: 既存の画像を再利用

# assetReuseExistingImagesHint
source: Use images already uploaded to the system
ja: システムにアップロード済みの画像を使用

# assetSelectFromAvailableImages
source: Select from Available Images
ja: 利用可能な画像から選択

# assetImagesSelectedCount
source: Images Selected ({count})
ja: 画像が選択されました ({count})

# assetMaxImagesWarning
source: Maximum 5 images allowed ({count} selected)
ja: 最大5枚の画像が許可されています（{count}枚選択済み）

# assetPickerTitle
source: Select Images
ja: 画像を選択

# assetPickerCountSelected
source: {count} selected
ja: {count}個選択済み

# assetPickerSelectButton
source: Select Images
ja: 画像を選択

# assetPickerSelectWithCount
source: Select ({count})
ja: 選択 ({count})

# assetFailedToLoadImages
source: Failed to load images
ja: 画像の読み込みに失敗しました

# assetRetry
source: Retry
ja: 再試行

# assetNoImagesAvailable
source: No images available
ja: 利用可能な画像がありません

# assetExistingImages
source: Existing Images
ja: 既存の画像

# assetExistingImagesHint
source: Images already attached to this asset
ja: この資産に既に添付されている画像

# assetPrimaryImage
source: Primary
ja: メイン

# assetUpdateImagesHint
source: Select new images to update (existing images will remain)
ja: 新しい画像を選択して更新（既存の画像は保持されます）

source: Asset Images
ja: 資産画像

# assetMovementDeleteAssetMovement
source: Delete Asset Movement
id: Hapus Perpindahan Aset
ja: 資産移動を削除

# assetMovementDeleteConfirmation
source: Are you sure you want to delete this asset movement record?
id: Apakah Anda yakin ingin menghapus catatan perpindahan aset ini?
ja: この資産移動記録を削除してもよろしいですか？

# assetMovementCancel
source: Cancel
id: Batal
ja: キャンセル

# assetMovementDelete
source: Delete
id: Hapus
ja: 削除

source: Asset Movement Detail
id: Detail Perpindahan Aset
ja: 資産移動詳細

# assetMovementInformation
source: Movement Information
id: Informasi Perpindahan
ja: 移動情報

# assetMovementId
source: Movement ID
id: ID Perpindahan
ja: 移動ID

# assetMovementAsset
source: Asset
id: Aset
ja: 資産

# assetMovementMovementType
source: Movement Type
id: Jenis Perpindahan
ja: 移動タイプ

# assetMovementFromLocation
source: From Location
id: Dari Lokasi
ja: 移動元の場所

# assetMovementToLocation
source: To Location
id: Ke Lokasi
ja: 移動先の場所

# assetMovementFromUser
source: From User
id: Dari Pengguna
ja: 移動元のユーザー

# assetMovementToUser
source: To User
id: Ke Pengguna
ja: 移動先のユーザー

# assetMovementMovedBy
source: Moved By
id: Dipindahkan Oleh
ja: 移動者
