Repository: Rizz404/sigma_track
Catalog: lib/l10n/app_*.arb
Languages: id, ja

# maintenanceScheduleOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# maintenanceScheduleFailedToLoadTranslations
source: Failed to load translations
id: Gagal memuat terjemahan
ja: 翻訳の読み込みに失敗しました

# maintenanceScheduleSearchAsset
source: Search and select asset
id: Cari dan pilih aset
ja: 資産を検索して選択

# maintenanceScheduleSelectMaintenanceType
source: Select maintenance type
id: Pilih jenis pemeliharaan
ja: メンテナンスタイプを選択

# maintenanceScheduleEnterIntervalValue
source: Enter interval value (e.g., 3)
id: Masukkan nilai interval (contoh: 3)
ja: 間隔値を入力（例：3）

# maintenanceScheduleSelectIntervalUnit
source: Select interval unit
id: Pilih unit interval
ja: 間隔単位を選択

# maintenanceScheduleEnterScheduledTime
source: e.g., 09:30
id: contoh: 09:30
ja: 例：09:30

# maintenanceScheduleSelectState
source: Select state
id: Pilih status
ja: 状態を選択

# maintenanceScheduleEnterEstimatedCost
source: Enter estimated cost (optional)
id: Masukkan estimasi biaya (opsional)
ja: 予想コストを入力（任意）

# maintenanceScheduleSearchUser
source: Search and select user who created the schedule
id: Cari dan pilih pengguna yang membuat jadwal
ja: スケジュールを作成したユーザーを検索して選択

# maintenanceScheduleTranslations
source: Translations
id: Terjemahan
ja: 翻訳

# maintenanceScheduleEnglish
source: English
id: Inggris
ja: 英語

# maintenanceScheduleJapanese
source: Japanese
id: Jepang
ja: 日本語

# maintenanceScheduleIndonesian
source: Indonesian
id: Indonesia
ja: インドネシア語

# maintenanceScheduleEnterTitle
source: Enter title in {language}
id: Masukkan judul dalam {language}
ja: {language}でタイトルを入力

# maintenanceScheduleEnterDescription
source: Enter description in {language}
id: Masukkan deskripsi dalam {language}
ja: {language}で説明を入力

# maintenanceScheduleCancel
source: Cancel
id: Batal
ja: キャンセル

# maintenanceScheduleUpdate
source: Update
id: Perbarui
ja: 更新

# maintenanceScheduleCreate
source: Create
id: Buat
ja: 作成

source: Maintenance Schedule Management
id: Manajemen Jadwal Pemeliharaan
ja: メンテナンススケジュール管理

# maintenanceScheduleCreateTitle
source: Create Maintenance Schedule
id: Buat Jadwal Pemeliharaan
ja: メンテナンススケジュールの作成

# maintenanceScheduleCreateSubtitle
source: Add a new maintenance schedule
id: Tambah jadwal pemeliharaan baru
ja: 新しいメンテナンススケジュールを追加

# maintenanceScheduleSelectManyTitle
source: Select Many
id: Pilih Banyak
ja: 複数選択

# maintenanceScheduleSelectManySubtitle
source: Select multiple schedules to delete
id: Pilih beberapa jadwal untuk dihapus
ja: 削除する複数のスケジュールを選択

# maintenanceScheduleFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並び替え

# maintenanceScheduleFilterAndSortSubtitle
source: Customize schedule display
id: Sesuaikan tampilan jadwal
ja: スケジュール表示をカスタマイズ

# maintenanceScheduleSelectToDelete
source: Select maintenance schedules to delete
id: Pilih jadwal pemeliharaan untuk dihapus
ja: 削除するメンテナンススケジュールを選択

# maintenanceScheduleSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並び替え

# maintenanceScheduleSortOrder
source: Sort Order
id: Urutan
ja: 並び順

# maintenanceScheduleReset
source: Reset
ja: リセット

# maintenanceScheduleApply
source: Apply
id: Terapkan
ja: 適用

# maintenanceScheduleFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# maintenanceScheduleFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# maintenanceScheduleDeleteSchedules
source: Delete Schedules
id: Hapus Jadwal
ja: スケジュールの削除

# maintenanceScheduleDeleteMultipleConfirmation
source: Are you sure you want to delete {count} schedules?
id: Apakah Anda yakin ingin menghapus {count} jadwal?
ja: {count}件のスケジュールを削除してもよろしいですか？

# maintenanceScheduleNoSchedulesSelected
source: No schedules selected
id: Tidak ada jadwal yang dipilih
ja: スケジュールが選択されていません

# maintenanceScheduleNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# maintenanceScheduleSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}件選択中

# maintenanceScheduleDelete
source: Delete
id: Hapus
ja: 削除

# maintenanceScheduleSearch
source: Search schedules...
id: Cari jadwal...
ja: スケジュールを検索...

# maintenanceScheduleNoSchedulesFound
source: No schedules found
id: Tidak ada jadwal ditemukan
ja: スケジュールが見つかりません

# maintenanceScheduleCreateFirstSchedule
source: Create your first schedule to get started
id: Buat jadwal pertama Anda untuk memulai
ja: 最初のスケジュールを作成して始めましょう

# maintenanceScheduleLongPressToSelect
source: Long press to select more schedules
id: Tekan lama untuk memilih lebih banyak jadwal
ja: 長押しして複数のスケジュールを選択

# maintenanceScheduleMetadata
source: Metadata
ja: メタデータ

# maintenanceScheduleCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# maintenanceScheduleUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# maintenanceScheduleIntervalValueLabel
source: Interval Value
id: Nilai Interval
ja: 間隔値

# maintenanceScheduleIntervalUnitLabel
source: Interval Unit
id: Unit Interval
ja: 間隔単位

# maintenanceScheduleScheduledTimeLabel
source: Scheduled Time (HH:mm)
id: Waktu Terjadwal (JJ:mm)
ja: 予定時刻（HH:mm）

# maintenanceRecordDeleteRecord
source: Delete Maintenance Record
id: Hapus Catatan Pemeliharaan
ja: メンテナンス記録の削除

# maintenanceRecordDeleteConfirmation
source: Are you sure you want to delete "{title}"?
id: Apakah Anda yakin ingin menghapus "{title}"?
ja: 「{title}」を削除してもよろしいですか？

source: Maintenance record deleted
id: Catatan pemeliharaan dihapus
ja: メンテナンス記録を削除しました

# maintenanceRecordDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

source: Maintenance Record Detail
id: Detail Catatan Pemeliharaan
ja: メンテナンス記録詳細

source: Maintenance Record Information
id: Informasi Catatan Pemeliharaan
ja: メンテナンス記録情報

# maintenanceRecordTitle
source: Title
id: Judul
ja: タイトル

# maintenanceRecordNotes
source: Notes
id: Catatan
ja: メモ

# maintenanceRecordAsset
source: Asset
id: Aset
ja: 資産

# maintenanceRecordMaintenanceDate
source: Maintenance Date
id: Tanggal Pemeliharaan
ja: メンテナンス日

# maintenanceRecordCompletionDate
source: Completion Date
id: Tanggal Selesai
ja: 完了日

# maintenanceRecordDuration
source: Duration
id: Durasi
ja: 所要時間

# maintenanceRecordDurationMinutes
source: {minutes} minutes
id: {minutes} menit
ja: {minutes}分

# maintenanceRecordPerformedByUser
source: Performed By User
id: Dilakukan Oleh Pengguna
ja: 実行者（ユーザー）

# maintenanceRecordPerformedByVendor
source: Performed By Vendor
id: Dilakukan Oleh Vendor
ja: 実行者（業者）

# maintenanceRecordResult
source: Result
id: Hasil
ja: 結果

# maintenanceRecordActualCost
source: Actual Cost
id: Biaya Aktual
ja: 実際のコスト

# maintenanceRecordUnknownAsset
source: Unknown Asset
id: Aset Tidak Diketahui
ja: 不明な資産

# maintenanceRecordOnlyAdminCanEdit
source: Only admin can edit maintenance records
id: Hanya admin yang dapat mengedit catatan pemeliharaan
ja: 管理者のみがメンテナンス記録を編集できます

# maintenanceRecordOnlyAdminCanDelete
source: Only admin can delete maintenance records
id: Hanya admin yang dapat menghapus catatan pemeliharaan
ja: 管理者のみがメンテナンス記録を削除できます

# maintenanceRecordFailedToLoad
source: Failed to load maintenance record
id: Gagal memuat catatan pemeliharaan
ja: メンテナンス記録の読み込みに失敗しました

# maintenanceRecordEditRecord
source: Edit Maintenance Record
id: Edit Catatan Pemeliharaan
ja: メンテナンス記録の編集

# maintenanceRecordCreateRecord
source: Create Maintenance Record
id: Buat Catatan Pemeliharaan
ja: メンテナンス記録の作成

# maintenanceRecordFillRequiredFields
source: Please fill all required fields
id: Harap isi semua field yang wajib
ja: 必須項目をすべて入力してください

source: Maintenance record saved successfully
id: Catatan pemeliharaan berhasil disimpan
ja: メンテナンス記録を正常に保存しました

# maintenanceRecordOperationFailed
source: Operation failed
id: Operasi gagal
ja: 操作に失敗しました

# maintenanceRecordFailedToLoadTranslations
source: Failed to load translations
id: Gagal memuat terjemahan
ja: 翻訳の読み込みに失敗しました

# maintenanceRecordSearchSchedule
source: Search and select maintenance schedule
id: Cari dan pilih jadwal pemeliharaan
ja: メンテナンススケジュールを検索して選択

# maintenanceRecordSearchAsset
source: Search and select asset
id: Cari dan pilih aset
ja: 資産を検索して選択

# maintenanceRecordCompletionDateOptional
source: Completion Date (Optional)
id: Tanggal Selesai (Opsional)
ja: 完了日（任意）

# maintenanceRecordDurationMinutesLabel
source: Duration (Minutes)
id: Durasi (Menit)
ja: 所要時間（分）

# maintenanceRecordEnterDuration
source: Enter duration in minutes (optional)
id: Masukkan durasi dalam menit (opsional)
ja: 所要時間を分単位で入力（任意）

# maintenanceRecordSearchPerformedByUser
source: Search and select user who performed the maintenance
id: Cari dan pilih pengguna yang melakukan pemeliharaan
ja: メンテナンスを実行したユーザーを検索して選択

# maintenanceRecordPerformedByVendorLabel
source: Performed By Vendor
id: Dilakukan Oleh Vendor
ja: 実行者（業者）

# maintenanceRecordEnterVendor
source: Enter vendor name (optional)
id: Masukkan nama vendor (opsional)
ja: 業者名を入力（任意）

# maintenanceRecordSelectResult
source: Select maintenance result
id: Pilih hasil pemeliharaan
ja: メンテナンス結果を選択

# maintenanceRecordActualCostLabel
source: Actual Cost
id: Biaya Aktual
ja: 実際のコスト

# maintenanceRecordEnterActualCost
source: Enter actual cost (optional)
id: Masukkan biaya aktual (opsional)
ja: 実際のコストを入力（任意）

# maintenanceRecordTranslations
source: Translations
id: Terjemahan
ja: 翻訳

# maintenanceRecordEnglish
source: English
id: Inggris
ja: 英語

# maintenanceRecordJapanese
source: Japanese
id: Jepang
ja: 日本語

# maintenanceRecordIndonesian
source: Indonesian
id: Indonesia
ja: インドネシア語

# maintenanceRecordEnterTitle
source: Enter title in {language}
id: Masukkan judul dalam {language}
ja: {language}でタイトルを入力

# maintenanceRecordEnterNotes
source: Enter notes in {language}
id: Masukkan catatan dalam {language}
ja: {language}でメモを入力

# maintenanceRecordCancel
source: Cancel
id: Batal
ja: キャンセル

# maintenanceRecordUpdate
source: Update
id: Perbarui
ja: 更新

# maintenanceRecordCreate
source: Create
id: Buat
ja: 作成

source: Maintenance Record Management
id: Manajemen Catatan Pemeliharaan
ja: メンテナンス記録管理

# maintenanceRecordCreateTitle
source: Create Maintenance Record
id: Buat Catatan Pemeliharaan
ja: メンテナンス記録の作成

# maintenanceRecordCreateSubtitle
source: Add a new maintenance record
id: Tambah catatan pemeliharaan baru
ja: 新しいメンテナンス記録を追加

# maintenanceRecordSelectManyTitle
source: Select Many
id: Pilih Banyak
ja: 複数選択

# maintenanceRecordSelectManySubtitle
source: Select multiple records to delete
id: Pilih beberapa catatan untuk dihapus
ja: 削除する複数の記録を選択

# maintenanceRecordFilterAndSortTitle
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並び替え

# maintenanceRecordFilterAndSortSubtitle
source: Customize record display
id: Sesuaikan tampilan catatan
ja: 記録表示をカスタマイズ

# maintenanceRecordSelectToDelete
source: Select maintenance records to delete
id: Pilih catatan pemeliharaan untuk dihapus
ja: 削除するメンテナンス記録を選択

# maintenanceRecordSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並び替え

# maintenanceRecordSortOrder
source: Sort Order
id: Urutan
ja: 並び順

# maintenanceRecordReset
source: Reset
ja: リセット

# maintenanceRecordApply
source: Apply
id: Terapkan
ja: 適用

# maintenanceRecordFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# maintenanceRecordFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# maintenanceRecordDeleteRecords
source: Delete Records
id: Hapus Catatan
ja: 記録の削除

# maintenanceRecordDeleteMultipleConfirmation
source: Are you sure you want to delete {count} records?
id: Apakah Anda yakin ingin menghapus {count} catatan?
ja: {count}件の記録を削除してもよろしいですか？

# maintenanceRecordNoRecordsSelected
source: No records selected
id: Tidak ada catatan yang dipilih
ja: 記録が選択されていません

# maintenanceRecordNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# maintenanceRecordSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}件選択中

# maintenanceRecordDelete
source: Delete
id: Hapus
ja: 削除

# maintenanceRecordSearch
source: Search records...
id: Cari catatan...
ja: 記録を検索...

# maintenanceRecordNoRecordsFound
source: No records found
id: Tidak ada catatan ditemukan
ja: 記録が見つかりません

# maintenanceRecordCreateFirstRecord
source: Create your first record to get started
id: Buat catatan pertama Anda untuk memulai
ja: 最初の記録を作成して始めましょう

# maintenanceRecordLongPressToSelect
source: Long press to select more records
id: Tekan lama untuk memilih lebih banyak catatan
ja: 長押しして複数の記録を選択

# maintenanceRecordMetadata
source: Metadata
ja: メタデータ

# maintenanceRecordCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# maintenanceRecordUpdatedAt
source: Updated At
id: Diperbarui Pada
ja: 更新日時

# maintenanceRecordSchedule
source: Maintenance Schedule
id: Jadwal Pemeliharaan
ja: メンテナンススケジュール

source: Notification Management
id: Manajemen Notifikasi
ja: 通知管理

source: Notification Detail
id: Detail Notifikasi
ja: 通知詳細

# notificationMyNotifications
source: My Notifications
id: Notifikasi Saya
ja: 私の通知

# notificationDeleteNotification
source: Delete Notification
id: Hapus Notifikasi
ja: 通知を削除

# notificationDeleteConfirmation
source: Are you sure you want to delete this notification?
id: Apakah Anda yakin ingin menghapus notifikasi ini?
ja: この通知を削除してもよろしいですか？

# notificationDeleteMultipleConfirmation
source: Are you sure you want to delete {count} notifications?
id: Apakah Anda yakin ingin menghapus {count} notifikasi?
ja: {count}個の通知を削除してもよろしいですか？

# notificationCancel
source: Cancel
id: Batal
ja: キャンセル

# notificationDelete
source: Delete
id: Hapus
ja: 削除

# notificationOnlyAdminCanDelete
source: Only admin can delete notifications
id: Hanya admin yang dapat menghapus notifikasi
ja: 通知を削除できるのは管理者のみです

source: Notification deleted
id: Notifikasi dihapus
ja: 通知が削除されました

# notificationDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# notificationFailedToLoad
source: Failed to load notification
id: Gagal memuat notifikasi
ja: 通知の読み込みに失敗しました

source: Notification Information
id: Informasi Notifikasi
ja: 通知情報

# notificationTitle
source: Title
id: Judul
ja: タイトル

# notificationMessage
source: Message
id: Pesan
ja: メッセージ

# notificationType
source: Type
id: Jenis
ja: タイプ

# notificationPriority
source: Priority
id: Prioritas
ja: 優先度

# notificationIsRead
source: Is Read
id: Sudah Dibaca
ja: 既読

# notificationReadStatus
source: Read Status
id: Status Baca
ja: 既読状態

# notificationRead
source: Read
id: Dibaca
ja: 既読

# notificationUnread
source: Unread
id: Belum Dibaca
ja: 未読

# notificationYes
source: Yes
id: Ya
ja: はい

# notificationNo
source: No
id: Tidak
ja: いいえ

# notificationCreatedAt
source: Created At
id: Dibuat Pada
ja: 作成日時

# notificationExpiresAt
source: Expires At
id: Kadaluarsa Pada
ja: 有効期限

# notificationSearchNotifications
source: Search notifications...
id: Cari notifikasi...
ja: 通知を検索...

# notificationSearchMyNotifications
source: Search my notifications...
id: Cari notifikasi saya...
ja: 私の通知を検索...

# notificationNoNotificationsFound
source: No notifications found
id: Tidak ada notifikasi ditemukan
ja: 通知が見つかりません

# notificationNoNotificationsYet
source: You have no notifications
id: Anda tidak memiliki notifikasi
ja: 通知はありません

# notificationCreateFirstNotification
source: Create your first notification to get started
id: Buat notifikasi pertama Anda untuk memulai
ja: 最初の通知を作成して開始しましょう

# notificationCreateNotification
source: Create Notification
id: Buat Notifikasi
ja: 通知を作成

# notificationCreateNotificationSubtitle
source: Add a new notification
id: Tambah notifikasi baru
ja: 新しい通知を追加

# notificationSelectMany
source: Select Many
id: Pilih Banyak
ja: 複数選択

# notificationSelectManySubtitle
source: Select multiple notifications to delete
id: Pilih beberapa notifikasi untuk dihapus
ja: 削除する複数の通知を選択

# notificationFilterAndSort
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# notificationFilterAndSortSubtitle
source: Customize notification display
id: Sesuaikan tampilan notifikasi
ja: 通知表示をカスタマイズ

# notificationFiltersAndSorting
source: Filters & Sorting
id: Filter & Pengurutan
ja: フィルターと並べ替え

# notificationSelectNotificationsToDelete
source: Select notifications to delete
id: Pilih notifikasi untuk dihapus
ja: 削除する通知を選択

# notificationLongPressToSelect
source: Long press to select more notifications
id: Tekan lama untuk memilih lebih banyak notifikasi
ja: 長押ししてさらに通知を選択

# notificationSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}個選択済み

# notificationNoNotificationsSelected
source: No notifications selected
id: Tidak ada notifikasi yang dipilih
ja: 通知が選択されていません

# notificationFilterByUser
source: Filter by User
id: Filter berdasarkan Pengguna
ja: ユーザーでフィルター

# notificationFilterByRelatedAsset
source: Filter by Related Asset
id: Filter berdasarkan Aset Terkait
ja: 関連資産でフィルター

# notificationSearchUser
source: Search user...
id: Cari pengguna...
ja: ユーザーを検索...

# notificationSearchAsset
source: Search asset...
id: Cari aset...
ja: 資産を検索...

# notificationSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# notificationSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# notificationReset
source: Reset
ja: リセット

# notificationApply
source: Apply
id: Terapkan
ja: 適用

# notificationApplyFilters
source: Apply Filters
id: Terapkan Filter
ja: フィルターを適用

# notificationFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# notificationFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# notificationFiltersApplied
source: Filters Applied
id: Filter Diterapkan
ja: フィルター適用済み

# notificationNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

# notificationJustNow
source: Just now
id: Baru saja
ja: たった今

# notificationMinutesAgo
source: {minutes}m ago
id: {minutes}m yang lalu
ja: {minutes}分前

# notificationHoursAgo
source: {hours}h ago
id: {hours}j yang lalu
ja: {hours}時間前

# notificationDaysAgo
source: {days}d ago
id: {days}h yang lalu
ja: {days}日前

# notificationMarkAsRead
source: Mark as Read
id: Tandai Dibaca
ja: 既読にする

# notificationMarkAsUnread
source: Mark as Unread
id: Tandai Belum Dibaca
ja: 未読にする

# notificationMarkedAsRead
source: {count} marked as read
id: {count} ditandai dibaca
ja: {count}件を既読にしました

# notificationMarkedAsUnread
source: {count} marked as unread
id: {count} ditandai belum dibaca
ja: {count}件を未読にしました

source: Scan Log Management
id: Manajemen Log Pemindaian
ja: スキャンログ管理

source: Scan Log Detail
id: Detail Log Pemindaian
ja: スキャンログ詳細

# scanLogDeleteScanLog
source: Delete Scan Log
id: Hapus Log Pemindaian
ja: スキャンログを削除

# scanLogDeleteConfirmation
source: Are you sure you want to delete this scan log?
id: Apakah Anda yakin ingin menghapus log pemindaian ini?
ja: このスキャンログを削除してもよろしいですか？

# scanLogDeleteMultipleConfirmation
source: Are you sure you want to delete {count} scan logs?
id: Apakah Anda yakin ingin menghapus {count} log pemindaian?
ja: {count}個のスキャンログを削除してもよろしいですか？

# scanLogCancel
source: Cancel
id: Batal
ja: キャンセル

# scanLogDelete
source: Delete
id: Hapus
ja: 削除

# scanLogOnlyAdminCanDelete
source: Only admin can delete scan logs
id: Hanya admin yang dapat menghapus log pemindaian
ja: スキャンログを削除できるのは管理者のみです

source: Scan log deleted
id: Log pemindaian dihapus
ja: スキャンログが削除されました

# scanLogDeleteFailed
source: Delete failed
id: Gagal menghapus
ja: 削除に失敗しました

# scanLogFailedToLoad
source: Failed to load scan log
id: Gagal memuat log pemindaian
ja: スキャンログの読み込みに失敗しました

# scanLogInformation
source: Scan Information
id: Informasi Pemindaian
ja: スキャン情報

# scanLogScannedValue
source: Scanned Value
id: Nilai yang Dipindai
ja: スキャン値

# scanLogScanMethod
source: Scan Method
id: Metode Pemindaian
ja: スキャン方法

# scanLogScanResult
source: Scan Result
id: Hasil Pemindaian
ja: スキャン結果

# scanLogScanTimestamp
source: Scan Timestamp
id: Waktu Pemindaian
ja: スキャン日時

# scanLogLocation
source: Location
id: Lokasi
ja: 場所

# scanLogSearchScanLogs
source: Search scan logs...
id: Cari log pemindaian...
ja: スキャンログを検索...

# scanLogNoScanLogsFound
source: No scan logs found
id: Tidak ada log pemindaian ditemukan
ja: スキャンログが見つかりません

# scanLogCreateFirstScanLog
source: Create your first scan log to get started
id: Buat log pemindaian pertama Anda untuk memulai
ja: 最初のスキャンログを作成して開始しましょう

# scanLogCreateScanLog
source: Create Scan Log
id: Buat Log Pemindaian
ja: スキャンログを作成

# scanLogCreateScanLogSubtitle
source: Add a new scan log
id: Tambah log pemindaian baru
ja: 新しいスキャンログを追加

# scanLogSelectMany
source: Select Many
id: Pilih Banyak
ja: 複数選択

# scanLogSelectManySubtitle
source: Select multiple scan logs to delete
id: Pilih beberapa log pemindaian untuk dihapus
ja: 削除する複数のスキャンログを選択

# scanLogFilterAndSort
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# scanLogFilterAndSortSubtitle
source: Customize scan log display
id: Sesuaikan tampilan log pemindaian
ja: スキャンログ表示をカスタマイズ

# scanLogFiltersAndSorting
source: Filters & Sorting
id: Filter & Pengurutan
ja: フィルターと並べ替え

# scanLogSelectScanLogsToDelete
source: Select scan logs to delete
id: Pilih log pemindaian untuk dihapus
ja: 削除するスキャンログを選択

# scanLogLongPressToSelect
source: Long press to select more scan logs
id: Tekan lama untuk memilih lebih banyak log pemindaian
ja: 長押ししてさらにスキャンログを選択

# scanLogSelectedCount
source: {count} selected
id: {count} dipilih
ja: {count}個選択済み

# scanLogNoScanLogsSelected
source: No scan logs selected
id: Tidak ada log pemindaian yang dipilih
ja: スキャンログが選択されていません

# scanLogFilterByAsset
source: Filter by Asset
id: Filter berdasarkan Aset
ja: 資産でフィルター

# scanLogFilterByScannedBy
source: Filter by Scanned By
id: Filter berdasarkan Dipindai Oleh
ja: スキャンユーザーでフィルター

# scanLogSearchAsset
source: Search asset...
id: Cari aset...
ja: 資産を検索...

# scanLogSearchUser
source: Search user...
id: Cari pengguna...
ja: ユーザーを検索...

# scanLogSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# scanLogSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# scanLogHasCoordinates
source: Has Coordinates
id: Memiliki Koordinat
ja: 座標あり

# scanLogDateFrom
source: Date From
id: Tanggal Dari
ja: 開始日

# scanLogDateTo
source: Date To
id: Tanggal Sampai
ja: 終了日

# scanLogReset
source: Reset
ja: リセット

# scanLogApply
source: Apply
id: Terapkan
ja: 適用

# scanLogFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# scanLogFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました

# scanLogNotImplementedYet
source: Not implemented yet
id: Belum diimplementasikan
ja: まだ実装されていません

source: User Management
id: Manajemen Pengguna
ja: ユーザー管理

# userCreateUser
source: Create User
id: Buat Pengguna
ja: ユーザーを作成

# userAddNewUser
source: Add a new user
id: Tambah pengguna baru
ja: 新しいユーザーを追加

# userSelectMany
source: Select Many
id: Pilih Banyak
ja: 複数選択

# userSelectMultipleToDelete
source: Select multiple users to delete
id: Pilih beberapa pengguna untuk dihapus
ja: 削除する複数のユーザーを選択

# userFilterAndSort
source: Filter & Sort
id: Filter & Urutkan
ja: フィルターと並べ替え

# userCustomizeDisplay
source: Customize user display
id: Sesuaikan tampilan pengguna
ja: ユーザー表示をカスタマイズ

# userFilters
source: Filters
id: Filter
ja: フィルター

# userRole
source: Role
id: Peran
ja: 役割

# userEmployeeId
source: Employee ID
id: ID Karyawan
ja: 従業員ID

# userEnterEmployeeId
source: Enter employee ID...
id: Masukkan ID karyawan...
ja: 従業員IDを入力...

# userActiveStatus
source: Active Status
id: Status Aktif
ja: アクティブステータス

# userActive
source: Active
id: Aktif
ja: アクティブ

# userInactive
source: Inactive
id: Tidak Aktif
ja: 非アクティブ

# userSort
source: Sort
id: Urutkan
ja: 並べ替え

# userSortBy
source: Sort By
id: Urutkan Berdasarkan
ja: 並べ替え

# userSortOrder
source: Sort Order
id: Urutan
ja: 並べ替え順序

# userAscending
source: Ascending
id: Naik
ja: 昇順

# userDescending
source: Descending
id: Turun
ja: 降順

# userReset
source: Reset
ja: リセット

# userApply
source: Apply
id: Terapkan
ja: 適用

# userFilterReset
source: Filter reset
id: Filter direset
ja: フィルターをリセットしました

# userFilterApplied
source: Filter applied
id: Filter diterapkan
ja: フィルターを適用しました
